<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">

<head>
	<title>OpenSWAD Association</title>
	<link rel="StyleSheet" href="/swad.css" type="text/css" />
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-40768375-1', 'openswad.org', {
    'anonymizeIp': true,
    'storage': 'none',
    'clientId': window.localStorage.getItem('ga_clientId')
  });
  ga(function(tracker) {
    window.localStorage.setItem('ga_clientID', tracker.get('clientId'));
  });
  ga('send', 'pageview');

</script>
</head>

<body style="width:90%; padding:20px; margin:0 auto;">

	<div class="SWAD" style="text-align:center;">
	        <a href="http://openswad.org/" class="SWAD">
	        <img src="/logo/swad224x64.png" alt="SWAD" width="224" height="64" />
	        <br />shared workspace at a distance
	        </a>
	</div>

	<div style="text-align:center;">
		<h1>OpenSWAD Association</h1>
		<a href="http://creativecommons.org/licenses/by-sa/3.0/deed.es_ES" title="License of text on this page" class="COPYRIGHT"><img src="/img/cc-by-sa.png" style="width:88px; height=31px; vertical-align:middle;" alt="CC BY-SA" /></a>
		<a href="http://openswad.org/association/">OpenSWAD Association</a>, 2016-2017
	</div>

	<h2>The association</h2>

	<p>
	The <strong>OpenSWAD Association</strong> is a non-profit organization founded in
	<a href="https://en.wikipedia.org/wiki/Granada">Granada (Spain)</a>
	on March 26, 2016
	and registered on the Section 1 / National Number 610925 of the
	<a href="http://www.interior.gob.es/web/servicios-al-ciudadano/asociaciones">&quot;Registro Nacional de Asociaciones&quot;</a>
	(National Register of Associations) of Spain on September 21, 2016.
	</p>
	
	<h2>Purposes</h2>

	<p>
	The main mission of the OpenSWAD Association
	is to improve education worldwide
	through <a href="https://openswad.org/en">OpenSWAD.org</a> portal 
	and to support the development of the
	<a href="https://openswad.org/source/">free software SWAD</a>
	and the ecosystem of applications that arise around it.
	</p>
	
	<p>
	The association is responsible for the following goals:
	</p>

	<ul>
		<li>
		Provide a <strong>free service to support teaching</strong>
		(managed by the users themselves)
		in the website <a href="https://openswad.org/en">OpenSWAD.org</a> 
		through <a href="https://openswad.org/info/">the educational platform SWAD</a>
		</li>

		<li>
		Maintain proper function, both <strong>software and hardware</strong>,
		of the platform SWAD and other services
		<strong>in the website <a href="https://openswad.org/en">OpenSWAD.org</a></strong>
		</li>

		<li>
		Promote the use and publication of
		<strong><a href="https://en.wikipedia.org/wiki/Open_educational_resources">Open Educational Resources</a></strong>
		so that knowledge reaches more people
		</li>

		<li>
		Ensure <strong>protection of personal data</strong>
		and <strong>intellectual property rights</strong>
		in the website <a href="https://openswad.org/en">OpenSWAD.org</a>
		</li>

		<li>
		Ensure <strong>economic sustainability</strong>
		of the OpenSWAD.org project,
		the costs of which will preferably be financed
		with contributions from partners, advertising
		and voluntary donations from users
		</li>

		<li>
		Conduct <strong>advertising and marketing activities</strong>
		to promote the use of OpenSWAD.org platform
		by teachers and educational institutions worldwide
		</li>
		
		<li>
		Coordinate the <strong>OpenSWAD community</strong>
		</li>

		<li>
		Support the <strong>development and improvement
		of the <a href="https://openswad.org/source/">software SWAD</a>
		and the ecosystem of applications around it</strong>,
		including applications for mobile devices
		(<a href="https://openswad.org/swadroid/">SWADroid</a>, iSWAD and others)
		</li>
	</ul>

	<p>
	To fulfill these goals the following activities may be conducted:
	</p>

	<ul>
		<li>
		Answer questions, suggestions and user problems
		via email, <a href="https://twitter.com/openswad">social networks</a>
		and other media,
		regarding the operation of the website
		<a href="https://openswad.org/en">OpenSWAD.org</a>
		and the <a href="https://openswad.org/source/">software SWAD</a>
		</li>

		<li>
		Organize conferences, workshops and user meetings
		</li>

		<li>
		Organize programmers meetings and other programming activities
		</li>

		<li>		
		Create and publish user manuals, tutorials,
		presentations and other documents in open formats
		to facilitate the use of
		the <a href="https://openswad.org/info/">platform SWAD</a>
		and the ecosystem of applications around it
		</li>
	</ul>
	
	<h2>Statutes (in Spanish)</h2>
	
	<div style="padding:20px; background:#FFFFF0;">

	<h3 style="text-align:center;">ESTATUTOS</h3>

	<h4 style="text-align:center;">
	CAP&Iacute;TULO I<br />
	DISPOSICIONES GENERALES
	</h4>

	<h5>
	Art&iacute;culo 1. Denominaci&oacute;n.
	</h5>
	
	<p>
	Con la denominaci&oacute;n
	<strong>OpenSWAD Association</strong>
	se constituye una ASOCIACI&Oacute;N
	al amparo de la Ley Org&aacute;nica 1/2002, de 22 de marzo,
	reguladora del Derecho de Asociaci&oacute;n, y normas complementarias,
	con personalidad jur&iacute;dica y plena capacidad de obrar,
	careciendo de &aacute;nimo de lucro.
	</p>

	<p>
	En todo cuanto no est&eacute; previsto en los presentes Estatutos
	se aplicar&aacute; la citada Ley Org&aacute;nica 1/2002, de 22 de marzo,
	y las disposiciones complementarias de desarrollo.
	</p>

	<h5>
	Art&iacute;culo 2. Duraci&oacute;n.
	</h5>

	<p>
	Esta Asociaci&oacute;n se constituye por tiempo indefinido. 
	</p>

	<h5>
	Art&iacute;culo 3. Fines.
	</h5>

	<p>
	La Asociaci&oacute;n tiene como fines:
	</p>
	<ul>
	<li>
	Proporcionar un servicio gratuito de apoyo a la ense&ntilde;anza
	(gestionado por los propios usuarios) en el sitio web OpenSWAD.org
	a trav&eacute;s de la plataforma educativa SWAD.
	</li>
	<li>
	Mantener un correcto funcionamiento, en lo concerniente al software y al hardware,
	de la plataforma SWAD y de otros servicios en el sitio web OpenSWAD.org.
	</li>
	<li>
	Promover el uso y publicaci&oacute;n de Recursos Educativos Abiertos
	para que el conocimiento llegue a m&aacute;s personas.
	</li>
	<li>
	Garantizar la protecci&oacute;n de los datos personales
	y de los derechos de propiedad intelectual en el sitio web OpenSWAD.org.
	</li>
	<li>
	Garantizar la sostenibilidad econ&oacute;mica del proyecto OpenSWAD.org,
	cuyos costes preferentemente ser&aacute;n financiados
	con las aportaciones de los socios, publicidad y donaciones voluntarias de los usuarios.
	</li>
	<li>
	Realizar actividades de publicidad y marketing
	para fomentar el uso de la plataforma OpenSWAD.org
	por profesores e instituciones educativas de todo el mundo.
	</li>
	<li>
	Coordinar la comunidad OpenSWAD.
	</li>
	<li>
	Apoyar el desarrollo y la mejora del software SWAD
	y el ecosistema de aplicaciones en torno a &eacute;l,
	incluidas las aplicaciones para dispositivos m&oacute;viles (SWADroid, iSWAD y otros).
	</li>
	</ul>

	<h5>
	Art&iacute;culo 4. Actividades.
	</h5>

	<p>
	Para el cumplimiento de estos fines se realizar&aacute;n
	las siguientes actividades:
	</p>
	<ul>
	<li>
	Responder a las preguntas, sugerencias y problemas de los usuarios
	a trav&eacute;s de correo electr&oacute;nico, redes sociales y otros medios de comunicaci&oacute;n,
	en relaci&oacute;n con el funcionamiento del sitio OpenSWAD.org y el software SWAD.
	</li>
	<li>
	Organizar conferencias, seminarios y reuniones de usuarios.
	</li>
	<li>
	Organizar encuentros de programadores y otras actividades de programaci&oacute;n.
	</li>
	<li>
	Crear y publicar manuales de usuario, tutoriales, presentaciones
	y otros documentos en formatos abiertos
	para facilitar el uso de la plataforma SWAD
	y del ecosistema de aplicaciones alrededor de ella.
	</li>
	</ul>

	<h5>
	Art&iacute;culo 5. Domicilio social.
	</h5>

	<p>
	La Asociaci&oacute;n establece su domicilio social en Granada (Espa&ntilde;a),
	y el &aacute;mbito territorial en el que va a realizar
	principalmente sus actividades es todo el territorio de Espa&ntilde;a
	y cualquier otro pa&iacute;s del mundo.
	</p>
 
 	<h4 style="text-align:center;">
	CAP&Iacute;TULO II<br />
	ASAMBLEA GENERAL
	</h4>

	<h5>
	Art&iacute;culo 6. Naturaleza y composici&oacute;n.
	</h5>

	<p>
	La Asamblea General es el &oacute;rgano supremo de gobierno de la Asociaci&oacute;n
	y estar&aacute; integrada por todos los asociados.
	</p>

	<h5>
	Art&iacute;culo 7. Reuniones.
	</h5>

	<p>
	Las reuniones de la Asamblea General ser&aacute;n ordinarias y extraordinarias.
	La ordinaria se celebrar&aacute; una vez al a&ntilde;o
	dentro de los cuatro meses siguientes al cierre del ejercicio;
	las extraordinarias se celebrar&aacute;n
	cuando las circunstancias lo aconsejen,
	a juicio del Presidente/a,
	cuando la Junta Directiva lo acuerde
	o cuando lo proponga por escrito
	una d&eacute;cima parte de los asociados.
	</p>

	<h5>
	Art&iacute;culo 8. Convocatorias.
	</h5>

	<p>
	Las convocatorias de las Asambleas Generales
	se realizar&aacute;n por escrito
	expresando el lugar, d&iacute;a y hora de la reuni&oacute;n
	as&iacute; como el orden del d&iacute;a
	con expresi&oacute;n concreta de los asuntos a tratar.
	Entre la convocatoria y el d&iacute;a se&ntilde;alado
	para la celebraci&oacute;n de la Asamblea en primera convocatoria
	habr&aacute;n de mediar al menos quince d&iacute;as,
	pudiendo as&iacute; mismo hacerse constar si procediera
	la fecha y hora en que se reunir&aacute;
	la Asamblea en segunda convocatoria,
	sin que entre una y otra pueda mediar un plazo inferior a una hora. 
	</p>

	<h5>
	Art&iacute;culo 9. Adopci&oacute;n de acuerdos.
	</h5>

	<p>
	Las Asambleas Generales, tanto ordinarias como extraordinarias,
	quedar&aacute;n v&aacute;lidamente constituidas en primera convocatoria
	cuando concurran a ella un tercio de los asociados con derecho a voto,
	y en segunda convocatoria cualquiera que sea
	el n&uacute;mero de asociados con derecho a voto.
	</p>

	<p>
	Los acuerdos se tomar&aacute;n por mayor&iacute;a simple
	de las personas presentes o representadas
	cuando los votos afirmativos superen a los negativos,
	no siendo computables a estos efectos los votos nulos,
	en blanco, ni las abstenciones.
	</p>

	<p>
	Ser&aacute; necesaria la mayor&iacute;a cualificada de las personas presentes o representadas,
	que resultar&aacute; cuando los votos afirmativos superen la mitad de estas,
	para la: 

	<ol type="a">
		<li>
		Disoluci&oacute;n de la entidad.
		</li>

		<li>
		Modificaci&oacute;n de Estatutos,
		incluido el cambio de domicilio social.
		</li>

		<li>
		Disposici&oacute;n o enajenaci&oacute;n
		de bienes integrantes del inmovilizado.
		</li>

		<li>
		Remuneraci&oacute;n de los miembros de la Junta Directiva.
		</li>
	</ol>

	<h5>
	Art&iacute;culo 10. Facultades.
	</h5>

	<p>
	Son facultades de la Asamblea General:
	</p>

	<ol type="a">
		<li>
		Aprobar la gesti&oacute;n de la Junta Directiva.
		</li>

		<li>
		Examinar y aprobar las cuentas anuales.
		</li>

		<li>
		Elegir a los miembros de la Junta Directiva.
		</li>

		<li>
		Fijar las cuotas ordinarias o extraordinarias.
		</li>

		<li>
		Aprobar la disoluci&oacute;n de la Asociaci&oacute;n.
		</li>

		<li>
		Modificar los Estatutos, incluido el cambio de domicilio social.
		</li>

		<li>
		Disponer o enajenar los bienes.
		</li>

		<li>
		Aprobar, en su caso, la remuneraci&oacute;n de los miembros de la Junta Directiva.
		</li>

		<li>
		Cualquiera otra que no sea competencia atribuida a otro &oacute;rgano social.
		</li>
	</ol>


 	<h4 style="text-align:center;">
	CAP&Iacute;TULO III<br />
	JUNTA DIRECTIVA 
	</h4>

	<h5>
	Art&iacute;culo 11. Composici&oacute;n.
	</h5>

	<p>
	La Asociaci&oacute;n ser&aacute; gestionada y representada
	por una Junta Directiva formada por un Presidente/a, un Secretario/a y un Tesorero/a.
	</p>

	<p>
	Todos los cargos que componen la Junta Directiva ser&aacute;n gratuitos.
	Estos ser&aacute;n designados y revocados por la Asamblea General
	y su mandato tendr&aacute; una duraci&oacute;n de un a&ntilde;o.
	</p>

	<h5>
	Art&iacute;culo 12. Reuniones.
	</h5>

	<p>
	La Junta Directiva se reunir&aacute; cuantas veces lo determine
	su Presidente/a y a iniciativa o petici&oacute;n de dos de sus miembros.
	Quedar&aacute; constituida cuando asista
	la mitad m&aacute;s uno de sus miembros
	y para que sus acuerdos sean v&aacute;lidos
	deber&aacute;n ser tomados por mayor&iacute;a de votos.
	En caso de empate, el voto del Presidente/a ser&aacute; de calidad. 
	</p>

	<h5>
	Art&iacute;culo 13. Facultades.
	</h5>

	<p>
	Las facultades de la Junta Directiva se extender&aacute;n,
	con car&aacute;cter general,
	a todos los actos propios de las finalidades de la Asociaci&oacute;n,
	siempre que no requieran, seg&uacute;n estos Estatutos,
	autorizaci&oacute;n expresa de la Asamblea General.
	</p>

	<p>
	Son facultades particulares de la Junta Directiva:
	</p>

	<ol type="a">
		<li>
		Dirigir las actividades sociales
		y llevar la gesti&oacute;n econ&oacute;mica
		y administrativa de la Asociaci&oacute;n,
		acordando realizar los oportunos contratos y actos.
		</li>

		<li> 
		Ejecutar los acuerdos de la Asamblea General.
		</li>

		<li> 
		Formular y someter a la aprobaci&oacute;n de la Asamblea General
		los balances y las cuentas anuales. 
		</li>

		<li>
		Resolver sobre la admisi&oacute;n de nuevos asociados. 
		</li>

		<li> 
		Nombrar delegados para alguna determinada actividad de la Asociaci&oacute;n. 
		</li>

		<li>
		Cualquier otra facultad que no sea de la exclusiva competencia
		de la Asamblea General de socios. 
		</li>
	</ol>

	<h5>
	Art&iacute;culo 14. Presidente/a.
	</h5>

	<p>
	El Presidente/a tendr&aacute; las siguientes atribuciones:
	representar legalmente a la Asociaci&oacute;n
	ante toda clase de organismos p&uacute;blicos o privados;
	convocar, presidir y levantar las sesiones que celebre
	la Asamblea General y la Junta Directiva,
	as&iacute; como dirigir las deliberaciones de una y otra;
	ordenar pagos y autorizar con su firma los documentos, actas y correspondencia;
	adoptar cualquier medida urgente
	que la buena marcha de la Asociaci&oacute;n
	aconseje o en el desarrollo de sus actividades
	resulte necesaria o conveniente,
	sin perjuicio de dar cuenta posteriormente a la Junta Directiva.
	</p>

	<h5>
	Art&iacute;culo 15. Vicepresidente/a.
	</h5>

	<p>
	El Vicepresidente/a sustituir&aacute; al Presidente
	en ausencia de este, motivada por enfermedad o cualquier otra causa,
	y tendr&aacute; sus mismas atribuciones.
	</p> 

	<h5>
	Art&iacute;culo 16. Secretario/a.
	</h5>

	<p>
	El Secretario/a tendr&aacute; a cargo la direcci&oacute;n
	de los trabajos puramente administrativos de la Asociaci&oacute;n,
	expedir&aacute; certificaciones,
	llevar&aacute; los libros de la Asociaci&oacute;n
	legalmente establecidos y el fichero de asociados,
	y custodiar&aacute; la documentaci&oacute;n de la entidad,
	haciendo que se cursen las comunicaciones
	sobre designaci&oacute;n de Juntas Directivas
	y dem&aacute;s acuerdos sociales inscribibles
	a los Registros correspondientes,
	as&iacute; como el cumplimiento de las obligaciones documentales
	en los t&eacute;rminos que legalmente correspondan.
	</p>
 
	<h5>
	Art&iacute;culo 17. Tesorero/a.
	</h5>

	<p>
	El Tesorero/a recaudar&aacute; y custodiar&aacute;
	los fondos pertenecientes a la Asociaci&oacute;n
	y dar&aacute; cumplimiento a las &oacute;rdenes de pago
	que expida el Presidente/a.
	</p>

	<h5>
	Art&iacute;culo 18. Vocales.
	</h5>

	<p>
	Los Vocales tendr&aacute;n las obligaciones propias de su cargo
	como miembros de la Junta Directiva,
	y as&iacute; como las que nazcan de las delegaciones
	o comisiones de trabajo que la propia Junta les encomiende.
	</p> 

	<h5>
	Art&iacute;culo 19. R&eacute;gimen de bajas y suplencias.
	</h5>

	<p>
	Los miembros podr&aacute;n causar baja por renuncia voluntaria
	comunicada por escrito a la Junta Directiva
	y por incumplimiento de las obligaciones que tuvieran encomendadas.
	Las vacantes que por estos motivos se produzcan
	ser&aacute;n cubiertas provisionalmente por los dem&aacute;s miembros
	hasta la elecci&oacute;n definitiva por la Asamblea General
	convocada al efecto.
	</p>

	<p>
	Tambi&eacute;n podr&aacute;n causar baja por expiraci&oacute;n del mandato.
	En este caso continuar&aacute;n ostentando sus cargos hasta el momento
	en que se produzca la aceptaci&oacute;n de los que les sustituyan.
	</p>

 	<h4 style="text-align:center;">
	CAP&Iacute;TULO IV<br />
	SOCIOS/AS 
	</h4>

	<h5>
	Art&iacute;culo 20. Requisitos.
	</h5>

	<p>
	Podr&aacute;n pertenecer a la Asociaci&oacute;n aquellas personas
	con capacidad de obrar que tengan inter&eacute;s
	en el desarrollo de los fines de la Asociaci&oacute;n.
	</p>
 
	<h5>
	Art&iacute;culo 21. Clases.
	</h5>

	<p>
	Dentro de la Asociaci&oacute;n existir&aacute;n las siguientes clases de socios/as:
	</p>

	<ol type="a">
		<li>
		Promotores o fundadores, que ser&aacute;n aquellos que participen
		en el acto de constituci&oacute;n de la Asociaci&oacute;n.
		</li>

		<li>
		De n&uacute;mero, que ser&aacute;n los que ingresen
		despu&eacute;s de la constituci&oacute;n de la Asociaci&oacute;n.
		</li>

		<li>
		De honor, los que por su prestigio o por haber contribuido
		de modo relevante a la dignificaci&oacute;n y desarrollo de la Asociaci&oacute;n,
		se hagan acreedores a tal distinci&oacute;n.
		El nombramiento de los socios de honor corresponder&aacute;
		a la Junta Directiva.
		</li> 
	</ol>

	<h5>
	Art&iacute;culo 22. Baja.
	</h5>

	<p>
	Los socios/as causar&aacute;n baja por alguna de las causas siguientes:
	</p> 

	<ol type="a">
		<li>
		Por renuncia voluntaria, comunicada por escrito a la Junta Directiva. 
		</li>

		<li>
		Por incumplimiento de las obligaciones econ&oacute;micas,
		si dejara de satisfacer una cuota peri&oacute;dica. 
		</li>
	</ol>

	<h5>
	Art&iacute;culo 23. Derechos.
	</h5>

	<p>
	Los socios/as fundadores y de n&uacute;mero tendr&aacute;n los siguientes derechos:
	</p> 

	<ol type="a">
		<li>
		Tomar parte en cuantas actividades organice
		la Asociaci&oacute;n en cumplimiento de sus fines. 
		</li>

		<li>
		Disfrutar de todas las ventajas y beneficios
		que la Asociaci&oacute;n pueda obtener. 
		</li>

		<li>
		Participar en las Asambleas con voz y voto. 
		</li>

		<li>
		Ser electores y elegibles para los cargos directivos. 
		</li>

		<li>
		Recibir informaci&oacute;n sobre los acuerdos adoptados
		por los &oacute;rganos de la Asociaci&oacute;n. 
		</li>

		<li>
		Hacer sugerencias a los miembros de la Junta Directiva
		en orden al mejor cumplimiento de los fines de la Asociaci&oacute;n. 
		</li>
	</ol>

	<h5>
	Art&iacute;culo 24. Deberes.
	</h5>

	<p>
	Los socios/as fundadores y de n&uacute;mero
	tendr&aacute;n las siguientes obligaciones:
	</p>

	<ol type="a">
		<li>
		Cumplir los presentes Estatutos y los acuerdos v&aacute;lidos
		de las Asambleas y la Junta Directiva.
		</li>

		<li>
		Abonar las cuotas que se fijen.
		</li>

		<li>
		Asistir a las Asambleas y dem&aacute;s actos que se organicen.
		</li>

		<li>
		Desempe&ntilde;ar, en su caso, las obligaciones inherentes al cargo que ocupen.
		</li>
	</ol>

	<h5>
	Art&iacute;culo 25. Derechos y deberes de los socios de honor.
	</h5>

	<p>
	Los socios/as de honor tendr&aacute;n las mismas obligaciones
	que los fundadores y de n&uacute;mero
	a excepci&oacute;n de las previstas en los apartados b) y d), del art&iacute;culo anterior.
	</p>

	<p>
	Asimismo, tendr&aacute;n los mismos derechos a excepci&oacute;n
	de los que figuran en los apartados c) y d) del art&iacute;culo 23,
	pudiendo asistir a las asambleas sin derecho de voto.
	</p>

 	<h4 style="text-align:center;">
	CAP&Iacute;TULO V<br />
	R&Eacute;GIMEN ECON&Oacute;MICO 
	</h4>

	<h5>
	Art&iacute;culo 26. Recursos econ&oacute;micos.
	</h5>

	<p>
	Los recursos econ&oacute;micos previstos para el desarrollo
	de los fines y actividades de la Asociaci&oacute;n ser&aacute;n los siguientes: 
	</p>

	<ol type="a">
		<li>
		Las cuotas de socios/as, peri&oacute;dicas o extraordinarias.
		</li>

		<li>
		Las subvenciones, legados o herencias que pudiera recibir
		de forma legal por parte de los asociados o de terceras personas.
		</li>

		<li>
		Cualquier otro recurso l&iacute;cito.
		</li>
	</ol>

	<h5>
	Art&iacute;culo 27. Patrimonio.
	</h5>

	<p>
	La Asociaci&oacute;n carece de patrimonio en el momento de su constituci&oacute;n.
	</p>

	<h5>
	Art&iacute;culo 28. Duraci&oacute;n del ejercicio.
	</h5>

	<p>
	El ejercicio asociativo y econ&oacute;mico ser&aacute; anual
	y su cierre tendr&aacute; lugar el 31 de marzo de cada a&ntilde;o.
	</p>

 	<h4 style="text-align:center;">
	CAP&Iacute;TULO VI<br />
	DISOLUCI&Oacute;N
	</h4>

	<h5>
	Art&iacute;culo 29. Disoluci&oacute;n.
	</h5>

	<p>
	La Asociaci&oacute;n se disolver&aacute; voluntariamente
	cuando as&iacute; lo acuerde la Asamblea General Extraordinaria,
	convocada al efecto, con arreglo a lo dispuesto en el art&iacute;culo 9 de los presentes Estatutos.
	</p>

	<h5>
	Art&iacute;culo 30. Liquidaci&oacute;n y destino del remanente.
	</h5>

	<p>
	En caso de disoluci&oacute;n se nombrar&aacute; una comisi&oacute;n liquidadora.
	Una vez extinguidas las deudas, el sobrante l&iacute;quido, en su caso,
	se destinar&aacute; para fines que no desvirt&uacute;en
	la naturaleza no lucrativa de la Asociaci&oacute;n.
	</p>
 
 	<p style="margin-top:5em;">
	En Granada, a 26 de marzo de 2016
	</p>
 
	<p>
	D. Antonio Ca&ntilde;as Vargas<br />
	D. Juan Miguel Boyero Corral<br />
	D&Ntilde;A. Eva Mart&iacute;nez Ortigosa<br />
	D&Ntilde;A. Mancia Anguita L&oacute;pez<br />
	D. Francisco Javier Fern&aacute;ndez Baldomero
	</p>

	</div>
	
	<!--
	<h2>Documents</h2>
	
	<ul>
	
		<li>
		<a href="http://www.asociaciones.org/index.php?option=com_content&view=article&id=622&Itemid=41">
		C&oacute;mo crear una asociaci&oacute;n
		</a>
		</li>

		<li>
		<a href="http://www.interior.gob.es/web/servicios-al-ciudadano/modelos-de-solicitud/asociaciones/modelos-para-inscripciones-en-el-registro-naciona">
		Modelos para inscripciones en el Registro Nacional de Asociaciones
		</a>
		</li>
		
		<li>
		<a href="http://www.boe.es/buscar/doc.php?id=BOE-A-2002-5852">
		Ley Org&aacute;nica 1/2002, de 22 de marzo, reguladora del Derecho de Asociaci&oacute;n
		</a>
		</li>
	</ul>
	-->

</body>

</html>
