<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">

 <head>
  <title>SWAD: Roadmap</title>
  <link rel="StyleSheet" href="/swad.css" type="text/css" />
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-40768375-1', 'openswad.org', {
    'anonymizeIp': true,
    'storage': 'none',
    'clientId': window.localStorage.getItem('ga_clientId')
  });
  ga(function(tracker) {
    window.localStorage.setItem('ga_clientID', tracker.get('clientId'));
  });
  ga('send', 'pageview');

</script>
 </head>

 <body>
  <table width="100%" border="0" cellpadding="20" cellspacing="0">
   <tr>
    <td align="center">
     <table width="90%" border="0" cellspacing="20">

	<tr>
	<td align="center" class="SWAD">
	        <a href="http://openswad.org/" class="SWAD"><img src="/logo/swad224x64.png" alt="SWAD" width="224" height="64" />
	        <br />shared workspace at a distance</a>
	</td>
	</tr>

	<tr>
	<td align="center">
		<h1>Roadmap</h1>
		<a href="http://creativecommons.org/licenses/by-sa/3.0/deed.es_ES" title="License of text on this page" class="COPYRIGHT"><img src="/img/cc-by-sa.png" style="width:88px; height=31px; vertical-align:middle;" alt="CC BY-SA" /></a>
		<a href="https://openswad.org/en?usr=@acanas" target="_blank">Antonio Ca&ntilde;as Vargas</a>, 1999-2017
	</td>
	</tr>

	<tr>
	<td align="center">
		<cite>
		Parece que es el fin<br />
		y solo es el comienzo.<br />
		</cite>
		<a href="https://www.youtube.com/watch?v=GiOhY8Oayxo">Nuestro tiempo, Amaral</a>
	</td>
	</tr>

	<tr>
	<td align="center">
		<cite>
		Just as in the sciences we have learned
		that we are too ignorant to safely pronounce anything impossible,
		so for the individual,
		since we cannot know just what are his limitations,
		we can hardly say with certainty
		that anything is necessarily within or beyond his grasp.
		Each must remember that no one can predict
		to what heights of wealth, fame, or usefulness he may rise
		until he has honestly endeavored,
		and he should derive courage from the fact that all sciences have been,
		at some time, in the same condition as he,
		and that it has often proved true that the dream of yesterday
		is the hope of today and the reality of tomorrow.
		</cite>
		<br />
		<a href="https://en.wikipedia.org/wiki/Robert_H._Goddard">
		Robert H. Goddard, &quot;On Taking Things for Granted&quot;, speech at his graduation ceremony, 1904
		</a>
	</td>
	</tr>

	<tr>
	<td align="left">

     	<p align="justify">
	The intent of the <a href="/author/">SWAD development team</a> is
	indefinitely continue expanding and improving the platform,
	adding new features and optimizing the existing,
	and encourage their use in other institutions.
	One of our main objectives is to allow
	a reliable, safe and efficient service
	with a minimal infrastructure even with a large number of users. 
	</p>

     	<p align="justify">
	The specific improvements and extensions to be offered in the future are as follows:
	</p>

	<hr />
	<h2>System</h2>

	<dl>
		<dt>
		System &gt; Links
		</dt>
		<dd>
		If there are no institutional links, do not show anything at right.
		</dd>

		<dt>
		System &gt; Plugins &gt; Edit
		</dt>
		<dd>
		Review form to edit plugins.
		</dd>
	</dl>

	<hr />
	<h2>Country</h2>

	<dl>
		<dt>
		Country &gt; Institutions &gt; Edit &gt; Logo
		</dt>
		<dd>
		Por cada logo, habr&iacute;a que subir tres im&aacute;genes GIF con el fondo transparente,
		y en las siguientes resoluciones:
		<ul>
			<li>Logo en tama&ntilde;o 16&times;16</li>
			<li>Logo en tama&ntilde;o 32&times;32</li>
			<li>Logo en tama&ntilde;o 64&times;64</li>
		</ul>
		</dd>
	</dl>

	<hr />
	<h2>Institution</h2>

	<dl>
		<dt>
		Institution &gt; Departments &gt; Edit &gt; Logo
		</dt>
		<dd>
		Por cada logo, habr&iacute;a que subir tres im&aacute;genes GIF con el fondo transparente,
		y en las siguientes resoluciones:
		<ul>
			<li>Logo en tama&ntilde;o 16&times;16</li>
			<li>Logo en tama&ntilde;o 32&times;32</li>
			<li>Logo en tama&ntilde;o 64&times;64</li>
		</ul>
		</dd>
	</dl>

	<hr />
	<h2>Centre</h2>

	<dl>
		<dt>
		Centre &gt; Degrees &gt; Edit &gt; Logo
		</dt>
		<dd>
		Por cada logo, habr&iacute;a que subir tres im&aacute;genes GIF con el fondo transparente,
		y en las siguientes resoluciones:
		<ul>
			<li>Logo en tama&ntilde;o 16&times;16</li>
			<li>Logo en tama&ntilde;o 32&times;32</li>
			<li>Logo en tama&ntilde;o 64&times;64</li>
		</ul>
		</dd>

		<dt>
		Centre &gt; Students groups (similar to courses)
		</dt>
		<dd>
		Suggested by Ricardo M. Rubert via Twitter:
		&quot;A algunos alumnos nos ser&iacute;a muy &acute;til poder crear grupos
		(ajenos a una asignatura) de personas para organizarnos.
		Ser&iacute;a una buena caracter&iacute;stica a implementar.
		Una versi&oacute;n simplificada, a&ntilde;adir alumnos por ID, foro, chat, archivos y notificaciones.
		No necesitamos m&aacute;s.&quot;
		</dd>
	</dl>

	<hr />
	<h2>Degree</h2>

	<dl>
		<dt>
		Degree &gt; Courses &gt; Edit
		</dt>
		<dd>
		Cuando se renombra el nombre breve de una asignatura,
		en &quot;Ir a &lt;asignatura&gt;&quot;
		deber&iacute;a aparecer el nuevo nombre abreviado de la asignatura,
		ahora aparece el antiguo.
		</dd>
	</dl>

	<hr />
	<h2>Course</h2>

	<dl>
		<dt>
		Course &gt; Configuration
		</dt>
		<dd>
		Configuraci&oacute;n de opciones disponibles en cada asignatura.
		Los profesores Bego&ntilde;a del Pino, Jos&eacute; Luis Bernier y Alberto P&eacute;rez L&oacute;pez
		sugieren que haya opciones de los men&uacute;s que aparezcan s&oacute;lo si el profesor lo desea,
		es decir, que haya opciones que puedan inhabilitarse (al parecer Moodle ofrece esta posibilidad).
		El problema que podr&iacute;a surgir es la confusi&oacute;n en los usuarios (estudiantes, principalmente),
		que podr&iacute;an perderse buscando una opci&oacute;n inexistente
		al recordar que en otra asignatura s&iacute; estaba disponible.
		</dd>

		<dt>
		Course &gt; Wiki integrado en la plataforma
		</dt>
		<dd>
		Se podr&iacute;a usar para redactar contenidos de la asignatura o,
		como sugiere Mar&iacute;a Salud Corts,
		para realizar trabajos acad&eacute;micos en peque&ntilde;os grupos redactados de forma conjunta.
		Para ello ser&iacute;a necesario que el acceso al wiki 
		estuviera restringido a los miembros del grupo.
		</dd>

		<dt>
		Course &gt; Teaching guide &gt Edit &gt; Internal editor
		</dt>
		<dd>
		Antonio S&aacute;nchez Pozo, en las I Jornadas de Innovaci&oacute;n Docente de la UGR,
		habl&oacute; de la importancia de las gu&iacute;as docentes,
		que tienen que estar implantadas en todas las asignaturas.
		En SWAD podr&iacute;a incorporarse la edici&oacute;n de la gu&iacute;a.<br />

		Una buena fuente de referencia puede ser el art&iacute;culo de las JENUI 2008
		&quot;Estrategia para el dise&ntilde;o de asignaturas en el EEES,
		de Ferm&iacute;n S&aacute;nchez, Jordi Garc&iacute;a y Mar&iacute;a Ribera Sancho:<br />
		
                &iquest;C&oacute;mo se har&iacute;a el dise&ntilde;o de una asignatura en el EEES?
	                <ol>
	                <li>Definir los objetivos de la asignatura
	                	<ol>
					<li>Objetivos generales</li> 
					<li>Objetivos espec&iacute;ficos</li>
				</ol>
	                </li>
	                <li>Definir los contenidos y las estrategias docentes</li> 
	                <li>Definir el m&eacute;todo de evaluaci&oacute;n 
	                <li>Estimar el trabajo del estudiante 
	                <li>Elaboraci&oacute;n de la gu&iacute;a docente
	                	<ul> 
	                		<li>Gu&iacute;a docente del profesor</li>
	                		<li>Gu&iacute;a docente del alumno</li>
	                	</ul>
	                </li>
	                <li>Revisar y actualizar el dise&ntilde;o de la asignatura</li>
	                </ol>
                </dd>

		<dt>
		Course &gt; Documents &gt; Group &gt; Public documents
		</dt>
		<dd>
		Public documents in groups should be accesible.
		Applicable to documents and shared files.
		</dd>

		<dt>
		Course &gt; Documents &gt; Public documents
		</dt>
		<dd>
		Importante: carpetas con documentos p&uacute;blicos pero ocultos no deber&iacute;an aparecer.
		</dd>

		<dt>
		Course &gt; Documents &gt; Edit &gt; Copy-paste
		</dt>
		<dd>
		When copy-paste, editors and licenses should be copy-pasted.
		Applicable to all file browsers.
		</dd>

		<dt>
		Course &gt; Documents &gt; Rename file
		</dt>
		<dd>
		Cambio de nombre de archivos.
		Actualmente pueden renombrarse las carpetas en las zonas de archivos.
		Habr&iacute;a que a&ntilde;adir la posibilidad de renombrar tambi&eacute;n los archivos,
		con la precauci&oacute;n de que la extensi&oacute;n del archivo no pueda cambiarse.
		Applicable to all file browsers.
		</dd>

		<dt>
		Course &gt; Documents &gt; Upload files
		</dt>
		<dd>
		Env&iacute;o de varios archivos simult&aacute;neamente.
		Consistir&iacute;a en subir un archivo ZIP,
		descomprimirlo en el servidor en un sitio privado,
		repasar cada uno de los ficheros viendo que se permite su extensi&oacute;n.
		Desde ah&iacute; los ficheros permitidos se ir&iacute;an
		copiando en el sitio definitivo siempre que no tuvieran
		el mismo nombre que otros ya existentes,
		en cuyo caso se abortar&iacute;a la copia igual que se hace ahora con copiar-pegar.
		Si el usuario quiere sobrescribir ficheros o carpetas tendr&iacute;a que borrarlos previamente.
		Applicable to all file browsers.
		</dd>

		<dt>
		Course &gt; Documents &gt; Upload files
		</dt>
		<dd>
		Env&iacute;o de archivos al servidor.
		Hay que investigar c&oacute;mo podr&iacute;a hacerse que cuando se suba un archivo
		aparezca una ventana pop-up que ponga algo as&iacute; como &quot;Enviando archivo...&quot;
		y sea la que realmente env&iacute;a el archivo,
		de tal modo que mientras se env&iacute;a el archivo se pudieran realizar otras tareas.
		Applicable to all file browsers.
		</dd>

		<dt>
		Course &gt; Documents &gt; Database
		</dt>
		<dd>
		Root folders should not be stored in paths in files table.
		Applicable to all file browsers.
		</dd>

		<dt>
		Course &gt; Documents &gt; Upload files
		</dt>
		<dd>
		Comprobaci&oacute;n de nombre en el env&iacute;o de archivos al servidor.
		La comprobaci&oacute;n de la validez del nombre de un archivo
		cuando se env&iacute;a al servidor deber&iacute;a realizarse
		antes de dicho env&iacute;o y no despu&eacute;s,
		sobre todo cuando el archivo es grande o la conexi&oacute;n lenta,
		pues se pierde un tiempo innecesario,
		ya que el mensaje aparece por ejemplo tras veinte minutos de espera.
		Es una Suggested by &Aacute;ngel Isac.
		</dd>

		<dt>
		Course &gt; Timetable &gt Edit
		</dt>
		<dd>
		M&aacute;s tipos de clase en la edici&oacute;n de horarios.
		Ahora aparecen las opciones &quot;libre&quot;, &quot;teor&iacute;a&quot; y &quot;pr&aacute;cticas&quot;.
		Deber&iacute;a poder indicarse el tipo de grupo,
		igual que ahora se hace cuando se crea un grupo.
		Es decir, que uno pueda inventar el nombre que aparecer&aacute;,
		sea Teor&iacute;a, Pr&aacute;cticas, M&oacute;dulo de Supervisi&oacute;n, o lo que sea.<br />

		Idea basada en una Suggested by Ana Mar&iacute;a Ramos Garc&iacute;a.
		</dd>

		<dt>
		Course &gt; Timetable &gt Edit
		</dt>
		<dd>
		Suggested by Francisco Oca&ntilde;a:<br />

		La especificaci&oacute;n de los horarios en SWAD est&aacute; pensada para asignaturas de grado.
		Sin embargo, en cursos de doctorado o m&aacute;ster,
		con frecuencia el horario de los cursos o asignaturas es intensivo,
		es decir, del tipo &quot;la semana del 9 al 13 marzo de tal hora a otra&quot;.
		Ser&iacute;a interesante la posibilidad de a&ntilde;adir
		en la especificaci&oacute;n del horario
		la escritura de un sencillo texto plano, tal y como aparece en la descripci&oacute;n de asignaturas, etc.<br />

		Tambi&eacute;n podr&iacute;a especificarse en cada casilla un rango de fechas.
		</dd>		

		<dt>
		Course &gt; Syllabus lectures / practicals &gt; Edit &gt; Internal editor &gt; Remove program
		</dt>
		<dd>
		Bot&oacute;n para eliminar un programa completo de teor&iacute;a o de pr&aacute;cticas en el editor interno.
		</dd>

		<dt>
		Course &gt; Bibliography / FAQ / Links
		</dt>
		<dd>
		Pasar p&aacute;ginas de bibliograf&iacute;a, FAQ, enlaces, etc.
		de directorios p&uacute;blicos a privados.
		En el caso de que la p&aacute;gina est&eacute; alojada en el servidor de SWAD,
		&eacute;sta se deber&iacute;a alojar permanentemente en un directorio privado
		y deber&iacute;a crearse un directorio temporal p&uacute;blico cada vez que se muestre,
		del mismo modo en que se hace para la descarga de documentos.
		</dd>

		<dt>
		Course &gt; Documents / Shared files
		</dt>
		<dd>
		&iquest;Cambiar estilos para los documentos?
		Todos los directorios se presentan con el mismo tama&ntilde;o de letra.
		Para facilitar la visualizaci&oacute;n de su contenido,
		&iquest;podr&iacute;a cambiarse el estilo de letra de los primeros directorios o padres
		(en muchos casos suelen corresponder con los temas de la asignatura)?
		</dd>

		<dt>
		Course &gt; Documents / Shared files &gt; Download statistics
		</dt>
		<dd>
		Archivos ya descargados y estad&iacute;sticas de descargas.
		Actualmente queda constancia de lo que cada estudiante ha descargado,
		aunque es dif&iacute;cil verlo en conjunto.
		Cada estudiante ver&iacute;a los archivos que ya ha descargado y los que no.
		Adem&aacute;s, junto a cada archivo podr&iacute;a indicarse
		el n&uacute;mero de descargas y el n&uacute;mero de usuarios distintos que lo han descargado.
		Y en estad&iacute;sticas se podr&iacute;a incluir una opci&oacute;n
		que resuma de forma sencilla lo que ha hecho cada estudiante.
		</dd>
		
		<dt>
		Course &gt; Planificaci&oacute;n temporal
		</dt>
		<dd>
		Crear un calendario en el cual se pueda ir escribiendo
		una descripci&oacute;n de las tareas correspondientes a cada d&iacute;a.
		Haciendo clic en un d&iacute;a se podr&iacute;an ver con detalle:
		contenido de las clases de ese d&iacute;a,
		referencias a archivos (de la zona de documentos) de la clase correspondiente de ese d&iacute;a,
		fechas l&iacute;mites de entrega de trabajos,
		cancelaci&oacute;n de clases, 
                fechas de conferencias, etc.<br />

		Tal vez se podr&iacute;a hacer un apartado para contenido previsto de cada clase
		y otro para contenido impartido realmente, de modo que:
		<ul>
			<li>el estudiante tuviera claro de antemano qu&eacute; se prev&eacute; dar en cada clase</li>
			<li>el estudiante supiera qu&eacute; se ha dado en cada clase</li>
			<li>el profesor pudiera planificar sus clases c&oacute;modamente</li>
			<li>el profesor pudiera comprobar c&oacute;mo se ajusta la realidad a la planificaci&oacute;n</li>
			<li>el profesor recordara lo que ha dado en cada clase</li>
		</ul>
		
		La planificaci&oacute;n deber&iacute;a incluir las actividades
		que debe o puede realizar el estudiante en cada tema o secci&oacute;n.
		Por ejemplo: actividad 1: visite la p&aacute;gina web W, haga el test del tema T, resuma el texto X, o haga el problema P.
		Ser&iacute;a interesante estudiar c&oacute;mo lo hacen otras plataformas como WebCT, Moodle, etc.
		</dd>

		<dt>
		Course &gt; Bibliography &gt; Edit &gt; Internal editor
		</dt>
		<dd>
		Editor espec&iacute;fico de la bibliograf&iacute;a.
		Igual que hay un editor espec&iacute;fico para los programas de teor&iacute;a y pr&aacute;cticas,
		se crear&iacute;a un editor espec&iacute;fico para la bibliograf&iacute;a,
		con campos como:
		<ul>
			<li>Imagen de portada</li>
			<li>T&iacute;tulo del libro y edici&oacute;n</li>
			<li>Autores</li>
			<li>Editorial</li>
			<li>Fecha de publicaci&oacute;n</li> 
			<li>&Iacute;ndice / Resumen de contenidos</li> 
			<li>Comentarios del profesor</li>
			<li>Comentarios de los estudiantes</li>
		</ul>
		</dd>

		<dt>
		Course &gt; FAQ &gt; Edit &gt; Internal editor
		</dt>
		<dd>
		Editor espec&iacute;fico para la FAQ.
		Igual que hay un editor espec&iacute;fico para los programas de teor&iacute;a y pr&aacute;cticas,
		se crear&iacute;a un editor espec&iacute;fico para la FAQ, con campos como: 
		<ul>
			<li>Pregunta</li> 
			<li>Respuesta</li>
		</ul>
		</dd>

		<dt>
		Course &gt; Links &gt; Edit &gt; Internal editor
		</dt>
		<dd>
		Editor espec&iacute;fico de enlaces. 
		Igual que hay un editor espec&iacute;fico para los programas de teor&iacute;a y pr&aacute;cticas,
		se crear&iacute;a un editor espec&iacute;fico para los enlaces, con campos como: 
		<ul>
			<li>URI</li>
			<li>Texto del enlace</li>
			<li>Descripci&oacute;n del contenido del enlace</li>
			<li>Tipo de documento enlazado (p&aacute;gina web, imagen, PDF, etc.)</li>
		</ul>
		</dd>

		<dt>
		Course &gt; Links &gt; Edit &gt; Internal editor
		</dt>
		<dd>
		Migraci&oacute;n de contenidos al est&aacute;ndar SCORM.
		</dd>

		<dt>
		Course &gt; Syllabus / Bibliography / FAQ... &gt; Reset
		</dt>
		<dd>
                Eliminaci&oacute;n de web interna/externa en editores de temarios, bibliograf&iacute;a, etc. 
		Actualmente no puede eliminarse un URL externo o una web interna una vez que se ha enviado.
		Habr&iacute;a que poner los botones correspondientes. 
		</dd>

		<dt>
		Course &gt; Syllabus / Bibliography / FAQ...
		</dt>
		<dd>
		P&aacute;ginas de bibliograf&iacute;a, FAQ, enlaces, etc., alojadas en SWAD.
		Estas p&aacute;ginas deber&iacute;an alojarse en un directorio privado.
		Cada vez que se muestra la p&aacute;gina, deber&iacute;a crearse un enlace temporal p&uacute;blico.
		</dd>

		<dt>
		Course &gt; Backup
		</dt>
		<dd>
		Deber&iacute;a haber una opci&oacute;n para crear una copia de seguridad de la asignatura.
		(Suggested by Ra&uacute;l Jim&eacute;nez Ortega).
		En esta opci&oacute;n el profesor marcar&iacute;a varias opciones de copia:
		estudiantes, documentos, foros, ex&aacute;menes de autoevaluaci&oacute;n, etc.
		El programa crear&iacute;a un archivo ZIP que el profesor descargar&iacute;a en su ordenador.
		Por supuesto, junto a la opci&oacute;n de hacer una copia de seguridad
		deber&iacute;a haber otra para restaurar la copia.
		</dd>
	</dl>

	<hr />
	<h2>Assessment</h2>

	<dl>
		<dt>
		Assessment &gt; Calendar
		</dt>
		<dd>
		Calendario con todas las convocatorias de examen.
		A&ntilde;adir un bot&oacute;n/enlace que permita mostrar en el calendario acad&eacute;mico
		los enlaces a todas las convocatorias de examen de todas las asignaturas del estudiante,
		no s&oacute;lo de la asignatura actual.
		</dd>

		<dt>
		Assessment &gt; Assessment system &gt; Edit &gt; Internal editor
		</dt>
		<dd>
		Editor del sistema de evaluaci&oacute;n.
		Igual que hay un editor espec&iacute;fico para los programas de teor&iacute;a y pr&aacute;cticas,
		se crear&iacute;a un editor espec&iacute;fico para el sistema de evaluaci&oacute;n.
		No est&aacute; claro qu&eacute; campos o caracter&iacute;sticas deber&iacute;a tener dicho editor,
		ya que puede haber muchas diferencias entre unas asignaturas/profesores y otras.
		</dd>

		<dt>
		Assessment &gt; Assignments
		</dt>
		<dd>
		Empty folders in assignments should be removed, and so they should not be include in ZIP file.
		Suggested by Pedro Mart&iacute;n Smith.
		</dd>

		<dt>
		Assessment &gt; Tests &gt; Real exams
		</dt>
		<dd>
		Mejorar los ex&aacute;menes de evaluaci&oacute;n real.
		Se podr&iacute;a incluir un tiempo m&aacute;ximo para responder a una pregunta de tipo test.
		De esta forma, el tiempo m&aacute;ximo para realizar el examen
		depender&iacute;a de la suma de dichos tiempos
		(seguramente habr&iacute;a que incrementarlo en un cierto porcentaje).
		Suggested by Ra&uacute;l Jim&eacute;nez Ortega.<br />

		Actualmente, el profesor, haciendo uso de los descriptores,
		puede se&ntilde;alar, en la lista de preguntas introducidas, 
		cu&aacute;les pueden ser susceptibles de ser incluidas en un examen.
		&iquest;Ser&iacute;a conveniente habilitar alg&uacute;n otro mecanismo 
		para hacer esto de una manera m&aacute;s f&aacute;cil?
		El profesor podr&iacute;a indicar a SWAD una lista de preguntas
		que conformar&iacute;an el examen.
		Posteriormente, el estudiante har&iacute;a una petici&oacute;n de realizaci&oacute;n de ese examen. 
		Deber&iacute;a controlarse la IP desde la cual se realizar&iacute;a el examen.
		Se podr&iacute;an utilizar tickets para realizar los ex&aacute;menes de un modo parecido
		a como se hace con los entregables en el art&iacute;culo de JENUI 2008
		&quot;Gesti&oacute;n de entregables con grupos grandes&quot,
		de Sergio Barrachina Mir, Asunci&oacute;n Casta&ntilde;o &Aacute;lvarez,
		Maribel Castillo Catal&aacute;n, Germ&aacute;n Le&oacute;n Navarro, Rafael Mayo Gual, Enrique Quintana Ort&iacute;.
		</dd>

		<dt>
		Assessment &gt; Access to GAP
		</dt>
		<dd>
		Acceso a GAP (Gesti&oacute;n Autom&aacute;tica de Pr&aacute;cticas) desde SWAD.
		Se trata de una sugerencia del profesor Juan Manuel Ben&iacute;tez S&aacute;nchez:
		&quot;Para que la gesti&oacute;n de la asignatura Estructuras de Datos
		se pueda hacer &iacute;ntegramente con SWAD
		necesitar&iacute;amos disponer de m&aacute;s control
		sobre la entrega de pr&aacute;cticas: fechas, ficheros, tama&ntilde;os, etc.
		y poder realizar algunas pruebas de forma autom&aacute;tica
		(compilaci&oacute;n y ejecuci&oacute;n bajo condiciones controladas).
		Actualmente utilizamos GAP como complemento ( http://www.gedlc.ulpgc.es/~juanca/gap/index.html ).
		&iquest;Se podr&iacute;a incluir en SWAD
		la funcionalidad de gesti&oacute;n de pr&aacute;cticas que provee GAP?
		Evidentemente, no es algo a resolver sobre la marcha,
		pero quiz&aacute;s se pudiese plantear como una nueva extensi&oacute;n a medio plazo,
		quiz&aacute;s para el curso pr&oacute;ximo.&quot;
		</dd>

		<dt>
		Assessment &gt; Test &gt; Edit
		</dt>
		<dd>
                Peque&ntilde;o inconveniente a corregir en los test.
		Al editar una pregunta de test, si falta alg&uacute;n par&aacute;metro,
		se desmarca &quot;Barajar&quot; en caso de que hubiera sido marcado.
		</dd>

 		<dt>
		Assessment &gt; Test &gt; Print view
		</dt>
		<dd>
		Imprimir ex&aacute;menes de autoevaluaci&oacute;n.
		A&ntilde;adir un bot&oacute;n o enlace que permita imprimir ex&aacute;menes de autoevaluaci&oacute;n.
		Suggested by Ra&uacute;l Jim&eacute;nez Ortega.
		</dd>

 		<dt>
		Assessment &gt; Test &gt; Print view
		</dt>
		<dd>
		Env&iacute;o de calificaciones por correo electr&oacute;nico.
		A&ntilde;adir la posibilidad de que el alumno reciba las calificaciones por correo electr&oacute;nico,
		si ha activado una opci&oacute;n para ello, que podr&iacute;a estar en sus preferencias.
		El profesor, tras colocar un nuevo archivo de calificaciones,
		debe tener la posibilidad de pulsar un bot&oacute;n
		que env&iacute;e un correo electr&oacute;nico a cada estudiante
		con la fila de la tabla de calificaciones que le corresponda.
		</dd>

  		<dt>
		Assessment &gt; Test
		</dt>
		<dd>
		Nuevos tipos de preguntas/respuestas de autoevaluaci&oacute;n.
		Estudiar qu&eacute; tipos de preguntas ofrece la herramienta Hot potatoes.
		</dd>

  		<dt>
		Assessment &gt; Test
		</dt>
		<dd>
		Medidas de dificultad de los test de autoevaluaci&oacute;n.
		Respecto a la evaluaci&oacute;n de la dificultad de los test de autoevaluaci&oacute;n,
		se puede consultar el art&iacute;culo de las JENUI 2008
		&quot;Un Estudio sobre la Dificultad de los Items en Tests de Inform&aacute;tica&quot;,
		de R. Conejo, E. Guzm&aacute;n de los Riscos, J. L. P&eacute;rez de la Cruz.
		Las conclusiones son que:
		<ul>
			<li>Los profesores no estiman bien la dificultad de los items de un test
			(incluso los alumnos son mejores realizando la estimaci&oacute;n).</li> 
			<li>Si se pretende administrar un test adaptativo,
			no es posible confiar en las dificultades estimadas por los profesores.</li>
			<li>El establecimiento de la nota de corte del test es arbitrario.</li>
		</ul>
		</dd>

  		<dt>
		Assessment &gt; Test
		</dt>
		<dd>
		Poner a cero contadores de test de autoevaluaci&oacute;n.
		Poner a cero tanto el contador de n&uacute;mero de test realizados por los estudiantes,
		como la nota promedio y el n&uacute;mero de veces que se ha respondido cada pregunta.
		Es una sugerencia del profesor Pepe Quiles. 
		</dd>

 		<dt>
		Assessment &gt; Test &gt; Edit questions
		</dt>
		<dd>
		Eliminaci&oacute;n de espacios iniciales.
		En las preguntas/respuestas de test y en general,
		donde se pase despu&eacute;s a RIGOROUS_HTML no hay que eliminar los espacios iniciales
		(con los finales no habr&iacute;a problema).
		En realidad se pueden eliminar las l&iacute;neas vac&iacute;as iniciales y finales, en lugar de los espacios.
		</dd>

 		<dt>
		Assessment &gt; Marks &gt; Edit
		</dt>
		<dd>
		Number of rows of header / footer in file of marks should be stored before showing files.<br />

		Number of rows of header / footer in file of marks should be calculated when pasting a file.
		</dd>
	</dl>

	<hr />
	<h2>Users</h2>

	<dl>
  		<dt>
		Users &gt; Students
		</dt>
		<dd>
		Eliminaci&oacute;n, cambio de grupo, etc. de estudiantes desde la lista.
		Los alumnos seleccionados en la lista de estudiantes podr&iacute;an eliminarse, cambiarse de grupo, etc.
		</dd>

  		<dt>
		Users &gt; Students / Teachers
		</dt>
		<dd>
		Show only main user's ID instead of all IDs?
		</dd>

  		<dt>
		Users &gt; New roles
		</dt>
		<dd>
		Nuevos tipos de usuarios.
		Podr&iacute;a a&ntilde;adirse un nuevo tipo de usuario que fuera administrativo o PAS.
		Podr&iacute;a distinguirse entre el profesor responsable tal y como est&aacute; ahora,
		que tiene un control completo sobre los usuarios y el material dentro de la asignatura,
		y un profesor &quot;invitado&quot; o &quot;ayudante&quot; con menos permisos.
		</dd>

  		<dt>
		Users &gt; Conoce a tus estudiantes
		</dt>
		<dd>
		A&ntilde;adir una nueva opci&oacute;n para que los profesores conozcan los nombres de sus estudiantes.
		Puede consistir, por ejemplo, en presentar una foto de un estudiante escogido al azar
		y que el profesor escriba el nombre y pulse enviar, tras lo cual se le presentar&iacute;a
		el nombre escrito por &eacute;l y el nombre real.
		O tambi&eacute; se puede dar a elegir entre el nombre real y otros nombres inventados
		(obteniendo nombres y apellidos al azar de la base de datos).
		</dd>

  		<dt>
		Users &gt; Students &gt; Records
		</dt>
		<dd>
		Mejoras de la edici&oacute;n de fichas de estudiantes.
		Editar varios campos de varias fichas y pulsar una &uacute;nica vez
		en &quot;Enviar&quot; o &quot;Modificar&quot;,
		en lugar de tener que ir rellenando cada campo
		y envi&aacute;ndolo antes de rellenar el siguiente.<br />

 		Una sugerencia similar de Inmaculada Szmolka Vida: en las fichas de los estudiantes en la asignatura,
 		se podr&iacute;an seleccionar los que te interesen y rellenar una sola vez un campo para todos.
 		Es decir, que si el profesor califica un trabajo como &quot;Bien&quot;,
 		calificar de una sola vez a todos los que hayan sacado esa calificaci&oacute;n.
 		</dd>

  		<dt>
		Users &gt; Groups
		</dt>
		<dd>
		Lista de grupos ocupando menos espacio.
		Una Suggested by Francisco Oca&ntilde;a: que exista alguna forma
		de presentar la lista de grupos en la que se minimice el espacio de la pantalla.
		Algo as&iacute; como el &aacute;rbol de carpetas de la zona de descargas,
		en la que el tipo de datos har&iacute;a las veces de carpeta ra&iacute;z de sus grupos,
		vi&eacute;ndolos como archivos.
		</dd> 

  		<dt>
		Users &gt; Enrollment requests
		</dt>
		<dd>
		Cuando un profesor confirma una petici&oacute;n de inscripci&oacute;n de un estudiante,
		no hay que volver a pedir confirmaci&oacute;n al estudiante.
		</dd>

  		<dt>
		Users &gt; Admin. users
		</dt>
		<dd>
		Al inscribir / eliminar varios usuarios, puede aparecer demasiada informaci&oacute;n,
		que habr&iacute;a que resumir. Podr&iacute;a ofrecerse un resumen del estilo:
		<ul>
			<li>Alumnos nuevos: XX (Ampliar)</li>
			<li>Alumnos que ya exist&iacute;an: XX (Ampliar)</li>
			<li>Alumnos que no se han podido crear: XX (Ampliar)</li>
			<li>Alumnos totales: XX (Ver lista de estudiantes)</li>
		</ul>
		Es una Suggested by Ra&uacute;l Jim&eacute;nez Ortega.
		</dd>

  		<dt>
		Users &gt; Admin. users
		</dt>
		<dd>
		Orlas en formato JPEG.
		A&ntilde;adir la posibilidad de ver/guardar cada orla como un archivo de imagen.
		</dd>

  		<dt>
		Users &gt; Admin. users
		</dt>
		<dd>
		Buscador de estudiantes.
		Podr&iacute;a ser &uacute;til para un profesor buscar un estudiante
		por nombre y apellidos o por correo electr&oacute;nico
		entre los alumnos de una o de todas sus asignaturas,
		sobre todo en asignaturas con muchos alumnos.
		El administrador de todo SWAD tambi&eacute;n deber&iacute;a poder
		buscar estudiantes de cualquier asignaturas, ya que en ocasiones llega 
		un correo electr&oacute;nico de alg&uacute;n estudiante solicitando ciertas gestiones,
		sin indicar su DNI. 
		</dd>
	</dl>

	<hr />
	<h2>Messages</h2>

	<dl>

  		<dt>
		Messages &gt; Notifications
		</dt>
		<dd>
		Notifications only for groups, at least in marks (check if now this is already implemented).
		Suggested by Benito Palacios.
		</dd>

  		<dt>
		Messages &gt; Notifications
		</dt>
		<dd>
		Cuando un usuario se da de baja de un grupo,
		deben desactivarse las notificaciones de documentos en ese grupo.
		</dd>

  		<dt>
		Messages &gt; Notifications &gt; RSS
		</dt>
		<dd>
		Suggested by Ricardo M. Rubert: RSS with notifications for each user.
		La URL deber&iacute;a ser larga y dif&iacute;cil de averiguar.
		</dd>

  		<dt>
		Messages &gt; Received messages
		</dt>
		<dd>
		&quot;Responder a todos&quot; en mensajes y en servicio web.
		Suggested by Juan Miguel Boyero Corral.
		</dd>

  		<dt>
		Messages &gt; Received messages
		</dt>
		<dd>
		Cuando al responder un mensaje se eligen varios destinatarios,
		el mensaje aparece como &quot;no respondido&quot; y no deber&iacute;a ser as&iacute;.
		</dd>

  		<dt>
		Messages &gt; Received/sent messages &gt; Search
		</dt>
		<dd>
		Try to optimize slow queries when searching a text in received or sent messages.
		</dd>

  		<dt>
		Messages &gt; Received/sent messages &gt; Remove messages
		</dt>
		<dd>
		Eliminaci&oacute;n de mensajes entre usuarios.
		Hay que corregir el siguiente problema:
		si hay un &uacute;nico mensaje de una asignatura y se elimina,
		deber&iacute;an salir los mensajes del resto de las asignaturas y no el aviso de que no hay mensajes,
		o al menos deber&iacute;a indicarse que no hay mensajes en la asignatura seleccionada
		y que pueden seleccionarse otras asignaturas.
		</dd>

  		<dt>
		Messages &gt; Videoconference
		</dt>
		<dd>
		Videoconferencia.
		En el futuro, en algunas aulas habr&aacute; posibilidad de realizar videoconferencias.
		Habr&iacute;a que pensar qu&eacute; deber&iacute;a aportar SWAD en este sentido.
		</dd>

  		<dt>
		Messages &gt; Tutor&iacute;as
		</dt>
		<dd>
		Mejorar las tutor&iacute;as de estudiantes incorporando en SWAD.
		algunas de las propuestas desarrolladas en los proyectos de innovaci&oacute;n en tutor&iacute;as,
		por ejemplo el proyecto de Jos&eacute; Luis Arco Tirado.
		</dd>

  		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		Categor&iacute;as en los foros.
		Se considerar&aacute; la posibilidad de a&ntilde;adir un nivel de categor&iacute;as
		dentro de cada uno de los foros, del mismo modo en que se hace
		en los foros de la E.T.S.I. Inform&aacute;tica y de Telecomunicaci&oacute;n.
		Por ejemplo, dentro del foro de la UGR se podr&iacute;a crear un subforo o categor&iacute;a para docencia,
		otro para ofertas de empleo, otro relacionado con demanda y oferta de alojamiento para estudiantes,
		otro para actividades deportivas, etc.
		Dentro de cada asignatura, los profesores podr&iacute;an crear subforos para la teor&iacute;a,
		las pr&aacute;cticas, el funcionamiento de la asignatura, etc.
		</dd>

  		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		Usuarios conectados en los foros.
		A&ntilde;adir bajo el nombre de cada usuario si ese usuario est&aacute; conectado o no.
		Suggested by Ra&uacute;l Jim&eacute;nez Ortega.
		</dd>

  		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		N&uacute;mero de usuarios leyendo cada foro.
		En muchos foros es t&iacute;pico que se presente el n&uacute;mero de usuarios
		que est&aacute;n accediendo a un foro en el momento actual.
		</dd>
 
   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		Personalizar el n&uacute;mero de hebras en cada p&aacute;gina de los foros.
		A&ntilde;adir la posibilidad de que cada usuario pueda decidir
		cu&aacute;ntas hebras se mostrar&aacute;n en cada p&aacute;gina.
		Suggested by Ra&uacute;l Jim&eacute;nez Ortega.
		</dd>

   		<dt>
		Messages &gt; Forum &gt; Edit
		</dt>
		<dd>
                Edici&oacute;n de mensajes del foro.
		A&ntilde;adir la posibilidad de que el autor de un mensaje del foro pueda editarlo,
		al menos en aquellos mensajes que a&uacute;n no hayan sido le&iacute;dos,
		o los que no hayan sido respondidos y cuya fecha de publicaci&oacute;n sea relativamente reciente.
		</dd>

   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		Enlaces internos a mensajes de foros.
		Posibilidad de hacer enlaces en los mensajes de un foro a un determinado mensaje / hebra.
		Suggested by Javier Fern&aacute;ndez Baldomero.
		</dd>

   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		Informaci&oacute;n del autor de un mensaje del foro.
		Que aparezca debajo del autor de un mensaje la titulaci&oacute;n a la que pertenece.
		Si pertenece a varias, &iquest;se pondr&iacute;an todas,
		o s&oacute;lo aquella en la que tenga m&aacute;s asignaturas?
		</dd>

   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		&iquest;Permitir a los administradores mover hebras de un foro a otro? 
		Actualmente s&oacute;lo puede mover hebras el superusuario.
		&iquest;Se deber&iacute;a permitir a los administradores de titulaciones
		la posibilidad de hacer lo mismo?
		En todo caso, un administrador s&oacute;lo podr&iacute;a mover hebras
		entre foros en los que tenga permiso de administraci&oacute;n.
		</dd>

   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		Marcar hebras como le&iacute;das.
		A&ntilde;adir una opci&oacute;n para marcar hebras como le&iacute;das
		(por si no te interesa leerlas) para que la pr&oacute;xima que se acceda 
		s&oacute;lo se mire entre las que realmente interesa leer.
		Suggested by Ra&uacute;l Jim&eacute;nez Ortega.
		</dd>

   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		&iquest;Marcar hebras como fijas? 
		Consistir&iacute;a en que los administradores de un foro
		pudiesen fijar hebras para que no bajaran aunque no se escriba en ellas.
		Estas hebras se podr&iacute;an usar para cuestiones importantes
		como las normas del foro o cualquier otro asunto que un profesor creyese importante resaltar.
		Suggested by Ra&uacute;l Jim&eacute;nez Ortega.
		</dd>

   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		Rol del autor de un mensaje de un foro. 
		Aparte del nombre del autor de un mensaje, se podr&iacute;a mostrar el rol (estudiante/profesor).
		Suggested by Ra&uacute;l Jim&eacute;nez Ortega.
		</dd>

   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		&iquest;Apodos en los foros? 
		&iquest;Ser&iacute;a interesante poder usar el apodo de un usuario en vez del nombre?
		Suggested by Ra&uacute;l Jim&eacute;nez Ortega.
		</dd>

   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		Foros para los grupos definidos en la asignatura.
		Del mismo modo que cada grupo puede tener una zona de archivos compartidos,
		podr&iacute;a permitirse que un grupo tuviera un foro o un subforo especial para &eacute;l.
		Propuesta de Bryan Robinson. 
		</dd>

   		<dt>
		Messages &gt; Forum
		</dt>
		<dd>
		Fecha inicial para el foro de la asignatura.
		Permitir que el profesor defina una fecha inicial para el foro de la asignatura,
		de modo que los alumnos no puedan ver las hebras con mensajes anteriores a esa fecha.
		Esto ser&iacute;a &uacute;til por ejemplo al principio de cada curso:
		el profesor podr&iacute;a seguir conservando y viendo todas las hebras,
		pero los estudiantes s&oacute;lo ver&iacute;an las hebras nuevas creadas en ese curso.
		Otra posibilidad alternativa es que el profesor disponga de una opci&oacute;n
		para guardar el contenido del foro y que despu&eacute;s pueda eliminar todos los mensajes.
		</dd>

   		<dt>
		Messages &gt; Attached files in messages
		</dt>
		<dd>
		Archivos adjuntos en los mensajes internos.
		Varios profesores y estudiantes indican que ser&iacute;a muy pr&aacute;ctico
		poder adjuntar archivos en los mensajes internos.
		Estudiar c&oacute;mo lo hace squirrelmail.
		&iquest;Podr&iacute;an adjuntarse varios archivos a un mensaje o s&oacute;lo un archivo?
		En caso de que el mensaje se dirija a varios destinatarios,
		el archivo adjunto al mensaje no deber&iacute;a duplicarse,
		sino que habr&iacute;a que almacenarlo internamente en un directorio con un nombre &uacute;nico,
		y en cada uno de los mensajes recibidos (y en el enviado)
		habr&iacute;a un enlace a dicho archivo.
		</dd>

   		<dt>
		Messages &gt; Attached files in forums
		</dt>
		<dd>
		Archivos adjuntos en el foro.
		Adem&aacute;s de poder adjuntar archivos en los mensajes internos entre usuarios,
		podr&iacute;a ser interesante adjuntar archivos en los mensajes de los foros.
		Aparecer&iacute;an como un enlace a un archivo interno.
		</dd>

   		<dt>
		Messages &gt; Remove messages
		</dt>
		<dd>
		Eliminar mensajes recibidos / enviados dentro de un rango de fechas.
		Eliminar todos los mensajes recibidos o enviados entre dos fechas
		o con m&aacute;s de cierta antig&uuml;edad.
		Se tratar&iacute;a de a&ntilde;adir un selector de rango de fechas
		en la opci&oacute;n de eliminar todos los mensajes.
		</dd>

   		<dt>
		Messages &gt; Avoid duplicate messages
		</dt>
		<dd>
		Evitar el env&iacute;o de mensajes duplicados.
		Evitar que las p&aacute;ginas de env&iacute;o de mensajes
		vuelan a enviar un mensaje cuando se pulse en actualizar en el navegador. 
		&iquest;C&oacute;mo podr&iacute;a hacerse?
		Una posibilidad es comprobar al recibir el mensaje que el usuario destino
		no tenga un mensaje id&eacute;ntico en una fecha muy reciente, o sin leer.
		Al emisor habr&iacute;a que indicarle que el mensaje no se ha enviado por ser duplicado.
		</dd>

   		<dt>
		Messages &gt; Notices
		</dt>
		<dd>
		Notas de aviso personales en forma de post-it.
		Reutilizando la opci&oacute;n de los avisos, cada usuario podr&iacute;a ponerse post-it con notas personales.
		</dd>

   		<dt>
		Messages &gt; Chat
		</dt>
		<dd>
		Mejoras en chat:
		<ul>
			<li>A&ntilde;adir pizarra interactiva a la versi&oacute;n actual del chat.</li>
			<li>Salas de pizarra/chat privadas para conversaciones entre dos usuarios.</li>
			<li>Carga de im&aacute;genes de fondo en la pizarra.
			Podr&iacute;an usarse, por ejemplo, para hacer anotaciones sobre cuadros o 
		        fotograf&iacute;as en Historia del Arte, en Medicina, etc.</li>
			<li>Fondos predise&ntilde;ados. Por ejemplo campos de f&uacute;tbol, baloncesto, etc.
			para explicar t&aacute;cticas de equipo en Ciencias del Deporte.</li>
		</ul>
		</dd>

   		<dt>
		Messages &gt; E-mail
		</dt>
		<dd>
		Env&iacute;o de correo electr&oacute;nico.
		Cuando se selecciona enviar correo electr&oacute;nico desde SWAD,
		las direcciones de correo no se exportan correctamente a Mozilla Thunderbird
		y es necesario editarlas posteriormente una a una
		(parece que introduce car&aacute;cteres innecesarios delante de las direcciones).
		Comprobar si sigue existiendo este problema, indicado por Juan Francisco Mart&iacute;nez Gallegos. 
		</dd>

   		<dt>
		Messages &gt; E-mail
		</dt>
		<dd>
		Env&iacute;o de correo electr&oacute;nico usuario por usuario.
		La opci&oacute;n de enviar correo electr&oacute;nico
		a todos los alumnos deber&iacute;a volver a programarse para que,
		en lugar de abrir el gestor de correo predeterminado,
		enviara el mensaje directamente por correo electr&oacute;nico
		a cada uno de los destinatarios, uno por uno.
		</dd>

   		<dt>
		Messages &gt; Received / sent
		</dt>
		<dd>
		Carpetas en los mensajes entre usuarios.
		Actualmente existe la posibilidad de ver los mensajes de cada asignatura por separado.
		Ra&uacute;l Jim&eacute;nez Ortega sugiere que cada usuario
		deber&iacute;a poder crear nuevas carpetas de correo donde colocar los mensajes.
		Quedar&iacute;a de este modo una carpeta &quot;Bandeja de entrada&quot;
		donde, como ahora, se podr&iacute;an separar los mensajes por asignatura de origen,
		y adem&aacute;s una serie de carpetas creadas por el usuario.
		Deber&iacute;a ser f&aacute;cil mover mensajes de una carpeta a otra.
		</dd>
 
    		<dt>
		Messages &gt; Sent
		</dt>
		<dd>
		Carpeta para los borradores de mensajes.
		A veces se pierde el contenido de un mensaje
		porque se pulsa involuntariamente alg&uacute;n enlace o bot&oacute;n
		mientras se est&aacute; escribiendo.
		Si el mensaje escrito era ya muy largo,
		esto ocasiona un grave inconveniente.
		Ser&iacute;a interesante crear alg&uacute;n mecanismo
		que permitiera ir guardando el contenido del mensaje antes de enviarlo,
		por ejemplo en una carpeta “borrador”.
		Sugerencia basada en comentarios de Ra&uacute;l Jim&eacute;nez Ortega y de Nicola Comunale.
		</dd>

    		<dt>
		Messages &gt; Notices
		</dt>
		<dd>
		Secci&oacute;n de avisos para todos los usuarios.
		El administrador de todo SWAD podr&iacute;a enviar
		avisos similares a los post-it para todos los usuarios de la plataforma.
		Con ellos se podr&iacute;a informar de novedades de la plataforma
		o seminarios sobre SWAD, as&iacute; como de otras cuestiones
		relacionadas con el funcionamiento de la universidad.
		Del mismo modo, los administradores de una titulaci&oacute;n
		podr&iacute;an poner avisos que s&oacute;lo fueran vistos por usuarios de esa titulaci&oacute;n.
		</dd>

    		<dt>
		Messages &gt; News
		</dt>
		<dd>
		Crear un m&oacute;dulo de noticias.
		El servicio podr&iacute;a ser similar al de http://meneame.net/
		Por ejemplo, en la UGR la Medina de Psicolog&iacute;a (http://medina-psicologia.ugr.es/ )
		usa un clon de men&eacute;ame para las noticias.
		Este servicio podr&iacute;a incorporar un m&oacute;dulo de RSS. 
		</dd>
	</dl>

	<hr />
	<h2>Statistics</h2>

	<dl>
		<dt>
		Statistics &gt; Activity reports
		</dt>
		<dd>
		Seguimiento del tiempo dedicado por los estudiantes a cada parte de la asignatura.
		Es muy interesante ver los tiempos que han dedicado los estudiantes.
		Los autores del art&iacute;culo de las JENUI 2008
		&quot;Estrategia para el dise&ntilde;o de asignaturas en el EEES&quot;
		han usado una herramienta para comprobar el tiempo real dedicado por ellos,
		y compararlo con el que estaba en la gu&iacute;a.
		En general, los estudiantes dedican menos tiempo que el que aparec&iacute;a en la gu&iacute;a docente.
			<ul>
				<li>Las horas se concentran al final del curso, antes del examen.</li>
				<li>Se puede ver en las gr&aacute;ficas c&oacute;mo unas asignaturas
				ocupan m&aacute;s tiempo que otras.</li>
			</ul>
 
		Ser&iacute;a muy interesante hacer una funcionalidad en SWAD para que los estudiantes
		fueran rellenando el tiempo que van dedicando
		a cada parte de la asignatura (estudio, problemas, trabajos, pr&aacute;cticas, etc.).<br />

		En otro art&iacute;culo de las JENUI 2008
		(&quot;Partes de actividad como herramienta para evaluar el esfuerzo invertido en el aprendizaje&quot;,
		de Ray Fern&aacute;ndez Rup&eacute;rez, Rosal&iacute;a Pe&ntilde;a, Esther Cerro),
		proponen una herramienta sencilla para que el estudiante
		pueda ir indicando el tiempo consumido: los partes de actividad.<br />

		Un parte de actividad consta de cuatro par&aacute;metros:
		qui&eacute;n, qu&eacute;, cu&aacute;ndo, cu&aacute;nto.
		En el caso del estudiante s&oacute;lo rellenan el cu&aacute;nto,
		puesto que los otros par&aacute;metros son conocidos.<br />

		Ya existe software comercial: myhours, b-kin.
		Los autores del art&iacute;culo han conseguido una licencia gratuita de b-kin para AENUI.
		Tambi&eacute;n usan Google Docs Spreadsheets:
		hacen una hoja de c&aacute;lculo en la que cada fila
		corresponde a un estudiante de un grupo de trabajo, y cada columna a una actividad.
		Cada alumno rellena semanalmente el tiempo empleado en cada actividad.
		Se hace un seguimiento por parte del Gabinete Psicopedag&oacute;gico.
		El 33% de los estudiantes han pedido ayuda al gabinete para su propia gesti&oacute;n del tiempo.
		Aparte de las columnas relacionadas con las asignaturas,
		tambi&eacute;n aparecen columnas como: dormir, deporte, relaciones sociales, tv/juegos.
		El estudiante aprende a desarrollar las competencias de gesti&oacute;n del tiempo y autoplanificaci&oacute;n.
		</dd>

		<dt>
		Statistics
		</dt>
		<dd>
		Estad&iacute;sticas tabuladas adicionales a las gr&aacute;ficas actuales.
		En cada gr&aacute;fica de estad&iacute;sticas,
		aparte de ofrecer una presentaci&oacute;n gr&aacute;fica,
		se podr&iacute;a obtener una presentaci&oacute;n alternativa con todos los datos tabulados,
		de tal manera que fuera sencillo copiar y pegar esos datos
		para su an&aacute;lisis con un cualquier programa estad&iacute;stico.
		Es una idea de Francisco A. Oca&ntilde;a Lara.
		</dd>
	</dl>

	<hr />
	<h2>Profile</h2>

	<dl>
		<dt>
		Profile &gt; Session
		</dt>
		<dd>
		Comprobar posible problema.
		Cuando se llama a la funci&oacute;n encargada de finalizar la ejecuci&oacute;n de SWAD
		porque ha habido alg&uacute;n error &iquest;se cierra la sesi&oacute;n?
		</dd>

		<dt>
		Profile &gt; Session
		</dt>
		<dd>
		Comprobar posible problema.
		Cuando se cierra una sesi&oacute;n, pero queda otra abierta en otro navegador,
		el usuario no deber&iacute;a desaparecer de los usuarios conectados.
		</dd>

		<dt>
		Profile &gt; Account
		</dt>
		<dd>
		When changing a user's ID, don't eliminate final letters.
		If a user have only one DNI stored in database with final alpha letter,
		he/she can not enter because final letter is removed in forms.
		</dd>

		<dt>
		Profile &gt; Record
		</dt>
		<dd>	
		Impresi&oacute;n de la ficha del usuario identificado.
		Incluir un bot&oacute;n para que cada usuario pueda imprimir su ficha.
		Es una sugerencia del profesor Francisco D&iacute;az Bretones. 
		</dd>

		<dt>
		Profile &gt; Record
		</dt>
		<dd>
		Deber&iacute;a ser obligatorio el tel&eacute;fono (posiblemente el tel&eacute;fono m&oacute;vil).
		</dd>

		<dt>
		Profile &gt; Record
		</dt>
		<dd>
		Caracteres especiales en nombre y apellidos.
		Impedir que los nombres, apellidos, etc. incluyan retornos de carro.
		Comprobar errores en nombres o apellidos de usuario que contengan comillas simples o dobles.
		Parece que hay errores.
		</dd>
		
		<dt>
		Profile &gt; Record &gt; Twitter
		</dt>
		<dd>
		Twitter field of common record should be visible for students?
		</dd>

		<dt>
		Profile &gt; Photo
		</dt>
		<dd>
		Mejora del programa de detecci&oacute;n de rostros humanos en las fotograf&iacute;as. 
		Se a&ntilde;adir&aacute;n nuevas caracter&iacute;sticas y algoritmos,
		o se mejorar&aacute; el entrenamiento del algoritmo actual,
		para alcanzar un mayor porcentaje de reconocimiento correcto.
		</dd>

		<dt>
		Profile &gt; Agenda personal
		</dt>
		<dd>
		Cada usuario dispondr&aacute; de una agenda personal
		tipo Sunbird (http://es.wikipedia.org/wiki/Mozilla_Sunbird), etc. 
		Suggested by Ra&uacute;l Jim&eacute;nez Ortega.
		</dd>

		<dt>
		Profile &gt; Preferemces
		</dt>
		<dd>
		Preferencias del usuario.
		Nuevas preferencias a elegir por el usuario en la opci&oacute;n &quot;Preferencias&quot;.
		<ul>
			<li>Si desea que su correo electr&oacute;nico sea p&uacute;blico dentro de la plataforma.
			Por defecto, esta opci&oacute;n deber&iacute;a estar desactivada.</li>
			<li>Si quiere que otros usuarios de la asignatura puedan verlo
			cuando est&aacute; conectado (los profesores deber&iacute;an ver a  los alumnos en cualquier caso).
			Por defecto, esta opci&oacute;n podr&iacute;a estar activada.</li>
			<li>N&uacute;mero de threads (hebras) que se mostrar&aacute;n
			en cada p&aacute;gina de los foros.</li>
			<li>En el caso de los estudiantes, si desean recibir sus calificaciones
			autom&aacute;ticamente por correo electr&oacute;nico.
			Por defecto, esta opci&oacute;n deber&iacute;a estar activada.</li>
		</ul>
		</dd>
	</dl>

	<hr />
	<h2>Miscelaneous</h2>

	<dl>

		<dt>
		Text editor
		</dt>
		<dd>
		Se a&ntilde;adir&aacute; un editor de texto que permita incluir:
		<ul>
			<li>Negritas y cursivas.</li>
			<li>Tama&ntilde;o de letra (cabeceras).</li>
			<li>Listas numeradas o no numeradas.</li>
			<li>Texto preformateado (tipo de letra monoespaciada, respetando espacios, retornos de carro, etc.).</li>
			<li>Sub&iacute;ndices y super&iacute;ndices.</li>
			<li>Enlaces de hipertexto.</li>
			<li>Im&aacute;genes. Convendr&iacute;a incorporar a SWAD
			un repositorio de im&aacute;genes
			para no tener que depender de repositorios externos como http://imageshack.us/</li> 
			<li>S&iacute;mbolos griegos, matem&aacute;ticos,...
			escritos directamente como caracteres especiales de HTML.</li>
		</ul>
		M&aacute;s adelante se a&ntilde;adir&aacute;n f&oacute;rmulas matem&aacute;ticas escritas en Latex,
		que se visualizar&aacute;n como im&aacute;genes.
		El editor dispondr&aacute; de una serie de botones que incluir&aacute;n las etiquetas HTML necesarias.
		El usuario podr&aacute; editar directamente el texto en HTML
		y en cualquier momento dispondr&aacute; de un bot&oacute;n de “vista previa” que le permitir&aacute; 
		ver c&oacute;mo quedar&aacute; el texto antes de enviarlo.<br />
		El editor se usar&aacute; en los siguientes elementos de SWAD: 
		<ul>
			<li>Descripci&oacute;n de la asignatura, programas de teor&iacute;a y pr&aacute;cticas,
			bibliograf&iacute;a, FAQ, enlaces, y descripci&oacute;n del sistema de evaluaci&oacute;n.</li>
			<li>Enunciado y respuesta de ex&aacute;menes de autoevaluaci&oacute;n.</li>
			<li>Mensajes entre usuarios.</li>
			<li>Mensajes en los foros.</li>
		</ul>
		</dd>

		<dt>
		File browser &gt; ZIP
		</dt>
		<dd>
		ZIP con el contenido del directorio ra&iacute;z de una zona de archivos.
		</dd>

		<dt>
		File browser &gt; Remove all
		</dt>
		<dd>
		Eliminar todo en zona de archivos.
		Opci&oacute;n para eliminar completamente todos los archivos de una zona de exploraci&oacute;n de archivos. 
		</dd>

		<dt>
		Translation
		</dt>
		<dd>
		Mejora y ampliaci&oacute;n de la traducci&oacute;n a varios idiomas.
		El chat y pizarra virtual tambi&eacute;n podr&iacute;a traducirse.
		Podr&iacute;an a&ntilde;adirse nuevos idiomas.
		</dd>

		<dt>
		Help
		</dt>
		<dd>
		Informaci&oacute;n sobre el contenido de cada opci&oacute;n del men&uacute;.
		Ra&uacute;l Jim&eacute;nez Ortega propone una peque&ntilde;a descripci&oacute;n
		de lo que se va a encontrar dentro de cada opci&oacute;n,
		ya que esto ayudar&iacute;a mucho a los que empiezan con SWAD;
		incluso los que llevan un tiempo usando la plataforma,
		a veces olvidan para qu&eacute; serv&iacute;a alguno de los apartados.
		</dd>

		<dt>
		Help / Documentation
		</dt>
		<dd>
		Mejorar la documentaci&oacute;n de SWAD.
		Se trata de mejorar y escribir todos los art&iacute;culos que faltan en Wiki SWAD,
		a&ntilde;adiendo capturas de pantalla donde sea necesario.
		Actualmente, este wiki tiene un acceso restringido a unos pocos usuarios identificados.
		Tal vez hubiera que plantearse que el acceso fuera identificado,
		pero que cualquiera pudiera darse de alta sin necesidad de pedir el alta al administrador.
		</dd>

		<dt>
		Video tutorials
		</dt>
		<dd>
		Video tutoriales sobre SWAD.
		Nuevos video tutoriales de ayuda para profesores y estudiantes.
		Los que hay actualmente en http://openswad.org/video/
		</dd>

		<dt>
		Marketing
		</dt>
		<dd>
		V&iacute;deo de presentaci&oacute;n de SWAD.
		Crear un video publicitario de presentaci&oacute;n de SWAD,
		de contenido sencillo e impactante, en el que se muestren
		sus caracter&iacute;sticas principales y los beneficios que puede aportar a la docencia.
		</dd>

		<dt>
		Installation
		</dt>
		<dd>
		Mejorar / automatizar la instalaci&oacute;n del programa.
		</dd>

		<dt>
		E-learning standards
		</dt>
		<dd>
		Uso de est&aacute;ndares de e-learning.
		Estudiar qu&eacute; est&aacute;ndares de e-learning habr&iacute;a que usar.
		</dd>

		<dt>
		Hidden parameters
		</dt>
		<dd>
		Simplificar uso de tabla de par&aacute;metros ocultos.
		Si la tabla de par&aacute;metros ocultos s&oacute;lo se usa
		para la lista de c&oacute;digos de usuarios seleccionados, deber&iacute;a
		simplificarse su uso.
		</dd>

		<dt>
		Special characters
		</dt>
		<dd>
		Conversi&oacute;n de ciertos caracteres especiales.
		Solucionar el problema interno con los caracteres especiales con c&oacute;digos mayores que 255.
		Convertir esos caracteres correctamente de %XXXX a &amp;#YYYY;
		Validaci&oacute;n de ciertos caracteres especiales.
		Para que todas las p&aacute;ginas sean validadas completamente en XHTML 1.0 Transitional falta lo siguiente:
		<ul>
			<li>&amp; deber&iacute;a ser sustituido por &amp;amp; en todas las URL</li> 
			<li>los caracteres entre &amp;#128; y &amp;#159; deber&iacute;an ser sustituidos por sus equivalentes UNICODE</li>
		</ul>

		<dt>
		Regular expressions
		</dt>
		<dd>
		Uso de expresiones regulares.
		Arturo Gonz&aacute;lez Ferrer recomienda el uso de expresiones regulares con la biblioteca libpcre:
		<ul>
			<li>http://www.todo-linux.com/modules.php?name=News&file=article&sid=2602</li>
			<li>http://www.pcre.org/</li>
			<li>ftp://ftp.csx.cam.ac.uk/pub/software/programming/pcre/</li>
		</ul>
		</dd>
	</dl>

	</td>
	</tr>

     </table>
    </td>
   </tr>
  </table>
 </body>

</html>
