<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.1//EN" "http://www.w3.org/TR/xhtml11/DTD/xhtml11.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">

 <head>
  <title>SWAD: Proyectos fin de carrera</title>
  <link rel="StyleSheet" href="/swad.css" type="text/css" />
<script>
  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
  (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
  m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
  })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

  ga('create', 'UA-40768375-1', 'openswad.org', {
    'anonymizeIp': true,
    'storage': 'none',
    'clientId': window.localStorage.getItem('ga_clientId')
  });
  ga(function(tracker) {
    window.localStorage.setItem('ga_clientID', tracker.get('clientId'));
  });
  ga('send', 'pageview');

</script>
 </head>

 <body>
  <table width="100%" border="0" cellpadding="20" cellspacing="0">
   <tr>
    <td align="center">
     <table width="90%" border="0" cellspacing="20">

	<tr>
	<td align="center" class="SWAD">
	        <a href="http://openswad.org/" class="SWAD"><img src="/logo/swad224x64.png" alt="SWAD" width="224" height="64" />
	        <br />shared workspace at a distance</a>
	</td>
	</tr>

	<tr>
	<td align="center">
		<h1>Proyectos fin de carrera en la ETSIIT, Universidad de Granada</h1>
		<a href="http://creativecommons.org/licenses/by-sa/3.0/deed.es_ES" title="License of text on this page" class="COPYRIGHT"><img src="/img/cc-by-sa.png" style="width:88px; height=31px; vertical-align:middle;" alt="CC BY-SA" /></a>
		<a href="http://www.ugr.es/~acanas/">Antonio Ca&ntilde;as Vargas</a>, 2013-2014
	</td>
	</tr>

	<tr>
	<td align="left">

	<h2>2013-2014</h2>

	<p>
	Los interesados deben ponerse en contacto con el tutor:
	<a href="http://www.ugr.es/~acanas/">Antonio Ca&ntilde;as</a> (tel&eacute;fono 630879381, despacho ETSIIT 2-29)
	</p>

	<hr />

	<h3>Proyecto ofertado 1:
	iSWAD 2: ampliaci&oacute;n de la aplicaci&oacute;n cliente de la plataforma SWAD
	para dispositivos m&oacute;viles iOS</h3>

	<dl>
		<dt>Posibles interesados en desarrollarlo:</dt>
			<dd>
				<ul>
					<li>
					Estudiantes que ya conozcan o que quieran aprender a dise&ntilde;ar
					aplicaciones m&oacute;viles y que dispongan de un dispositivo iOS.
					</li>
				</ul>
			</dd>
		<dt>Planteamiento:</dt>
			<dd>
				<ul>
					<li>
					Se pretende continuar el desarrollo de un cliente m&oacute;vil
					para acceder a algunas funcionalidades de la plataforma SWAD
					en dispositivos m&oacute;viles basados en iOS: iPhone, iPod Touch o iPad.
					Actualmente est&aacute;n disponibles la aplicaciones
					SWADroid, para m&oacute;viles basados en Android,
					y iSWAD, para dispositivos iOS,
					desarrolladas ambas en proyectos fin de carrera anteriores.
					Con este proyecto se pretende ampliar las funcionalidades de iSWAD.
					</li>
				</ul>
			</dd>
		<dt>Objetivos:</dt>
			<dd>
				<ul>
					<li>
					Continuar el desarrollo del cliente iSWAD para iOS
					que se conecta con la plataforma SWAD
					a trav&eacute;s del servicio web
					descrito en la p&aacute;gina
					<a href="http://openswad.org/ws/">http://openswad.org/ws/</a>.
					</li>
					<li>
		       			Incluir en el proyecto al menos las funcionalidades
					con las que cuenta actualmente la aplicaci&oacute;n
					<a href="https://play.google.com/store/apps/details?id=es.ugr.swad.swadroid&hl=es">SWADroid</a>.
					</li>
					<li>
					Se contempla la posibilidad de ampliar las funcionalidades actuales de SWADroid.
					</li>
					<li>
		       			La aplicaci&oacute;n desarrollada se pondr&aacute; a disposici&oacute;n
					de los usuarios de forma gratuita en el Apple Store.
					</li>
				</ul>
			</dd>
		<dt>Desarrollo del proyecto:</dt>
			<dd>
				<ul>
					<li>
					Aprendizaje del lenguaje de programaci&oacute;n Objective C, en caso de que el estudiante no lo domine.
					</li>
					<li>
		        		Aprendizaje del entorno de desarrollo para iOS.
					</li>
					<li>
		        		Estudio del c&oacute;digo de la actual aplicaci&oacute;n iSWAD,
					disponible en la <a href="https://github.com/diegort/iSWAD">forja GitHub</a>
					</li>
					<li>
        				Implementaci&oacute;n de las nuevas funcionalidades.
					</li>
					<li>
		        		Subida de la aplicaci&oacute;n al Apple Store.
					</li>
					<li>
		        		Pruebas con usuarios reales.
					</li>
					<li>
		        		Posible ampliaci&oacute;n de las funcionalidades.
					</li>
				</ul>
			</dd>
	</dl>

	<hr />

	<h3>Proyecto ofertado 2:
	Ampliaci&oacute;n de SWADroid,
	aplicaci&oacute;n cliente de la plataforma SWAD
	para dispositivos m&oacute;viles Android</h3>

	<dl>
		<dt>Posibles interesados en desarrollarlo:</dt>
			<dd>
				<ul>
					<li>
					Estudiantes que ya conozcan o que quieran aprender a dise&ntilde;ar
					aplicaciones m&oacute;viles y que dispongan de un dispositivo Android.
					</li>
				</ul>
			</dd>
		<dt>Planteamiento:</dt>
			<dd>
				<ul>
					<li>
					Se pretende ampliar la aplicaci&oacute;n
					<a href="https://play.google.com/store/apps/details?id=es.ugr.swad.swadroid&hl=es">SWADroid</a>,
					un cliente m&oacute;vil para acceder a algunas funcionalidades de la plataforma SWAD en dispositivos m&oacute;viles Android.
					Actualmente est&aacute; disponible la aplicaci&oacute;n SWADroid para m&oacute;viles basados en Android,
					desarrollada en un proyecto fin de carrera anterior por Juan Miguel Boyero Corral, y
					continuada en otros dos proyectos por Antonio Aquilera Malag&oacute;n
					y Helena Rodr&iacute;guez Gij&oacute;n.
					Los usuarios de SWADroid demandan nuevas funcionalidades.
					Con este proyecto se pretende satisfacer dicha demanda y dar continuidad
					a un proyecto de software libre que ha tenido un notable &eacute;xito.
					</li>
				</ul>
			</dd>
		<dt>Objetivos:</dt>
			<dd>
				<ul>
					<li>
					Partiendo del c&oacute;digo fuente de SWADroid, que es software libre,
					ampliar las funcionalidades actuales
					a&ntilde;adiendo otras nuevas.
					</li>
					<li>
		       			La aplicaci&oacute;n desarrollada se pondr&aacute; a disposici&oacute;n
					de los usuarios de forma gratuita en Google Play.
					</li>
				</ul>
			</dd>
		<dt>Desarrollo del proyecto:</dt>
			<dd>
				<ul>
					<li>
					Estudio del c&oacute;digo fuente de SWADroid en su estado actual,
					disponible en la <a href="https://github.com/Amab/SWADroid">forja GitHub</a>.
					</li>
					<li>
		        		Aprendizaje del entorno de desarrollo para Android.
					</li>
					<li>
		        		Ampliaci&oacute;n de las funcionalidades que se acordar&aacute;n
					entre tutor y estudiante y tendr&aacute;n en cuenta las demandas de los usuarios.
					</li>
					<li>
        				Todo el software desarrollado ser&aacute; libre,
					respetando las licencias de la actual aplicaci&oacute;n SWADroid.
					</li>
					<li>
		        		A medida que se vayan desarrollando las nuevas funcionalidades
					se pondr&aacute;n a disposici&oacute;n de los usuarios en Google Play.
					</li>
				</ul>
			</dd>
	</dl>
	
	<hr />

	<h3>Proyecto ofertado 3:
	Trivial de la UGR</h3>

	<dl>
		<dt>Posibles interesados en desarrollarlo:</dt>
			<dd>
				<ul>
					<li>
					Estudiantes que ya conozcan o que quieran aprender a dise&ntilde;ar
					aplicaciones m&oacute;viles.
					</li>
				</ul>
			</dd>
		<dt>Planteamiento:</dt>
			<dd>
				<ul>
					<li>
					Actualmente en la plataforma SWAD hay m&aacute;s de
					18000 preguntas de tipo test de elecci&oacute;n
					&uacute;nica entre varias opciones.
					Estas preguntas corresponden a casi 300 asignaturas de distintas
					titulaciones.
					Se pretende realizar una aplicaci&oacute;n m&oacute;vil
					similar al Trivial Pursuit o a TriviaDos, que ofrezca
					preguntas al azar de toda la base de datos (siempre que los profesores
					implicados lo permitan), agrupadas en varias categor&iacute;as,
					una por cada &aacute;rea de conocimiento.
					</li>
				</ul>
			</dd>
		<dt>Objetivos:</dt>
			<dd>
				<ul>
					<li>
		       			Desarrollar una aplicaci&oacute;n para la plataforma Android o iOS
		       			que permita descargar una pregunta al azar del tema elegido,
		       			escogida de la base de datos disponible en el servidor,
		       			y mostrarla al usuario. La din&aacute;mica del juevo ser&aacute; similar a la
		       			de TriviaDos, con retos entre dos jugadores.
					</li>
				</ul>
			</dd>
		<dt>Desarrollo del proyecto:</dt>
			<dd>
				<ul>
					<li>
					En primer lugar se definir&aacute;n y desarrollar&aacute;n
					los servicios web necesarios, en el cliente de la aplicaci&oacute;n
					por parte del estudiante y en el servidor por parte del tutor.
					</li>
					<li>
		        		Se implementar&aacute; la interfaz gr&aacute;fica y el motor de la aplicaci&oacute;n.
					</li>
					<li>
		        		La aplicaci&oacute;n se pondr&aacute; a disposici&oacute;n de los usuarios
		        		para que hagan pruebas y se refinar&aacute; atendiendo a sus sugerencias.
					</li>
				</ul>
			</dd>
	</dl>

	<hr />

	<h3>Proyecto ofertado 4:
	SWAD2Moodle: Aumentando la compatibilidad entre las plataformas SWAD y Moodle</h3>

	<dl>
		<dt>Posibles interesados en desarrollarlo:</dt>
			<dd>
				<ul>
					<li>
					Estudiantes que quieran programar
					m&oacute;dulos sin interfaz gr&aacute;fica,
					y a los que les guste el XML,
					el an&aacute;lisis l&eacute;xico y sint&aacute;ctico,
					las expresiones regulares...
					</li>
				</ul>
			</dd>
		<dt>Planteamiento:</dt>
			<dd>
				<ul>
					<li>
					La plataforma SWAD es utilizada ampliamente en la Universidad de Granada.
					Actualmente tambi&eacute;n se utiliza en la Universidad Nacional de Asunci&oacute;n (Paraguay)
					y en el proyecto OpenSWAD.org.
					Por otra parte, cada vez son m&aacute;s los profesores
					que adem&aacute;s de SWAD utilizan Moodle y viceversa.
					El proyecto pretende abordar el estudio
					y la implementaci&oacute;n de m&oacute;dulos que faciliten
					la migraci&oacute;n de contenidos entre ambas plataformas,
					principalmente de SWAD hacia Moodle.
					</li>
				</ul>
			</dd>
		<dt>Objetivos:</dt>
			<dd>
				<ul>
					<li>
					Realizar un estudio de las necesidades de migraci&oacute;n de contenidos de SWAD a Moodle y viceversa.
					</li>
					<li>
		       			Desarrollar varios m&oacute;dulos que faciliten dicha migraci&oacute;n al profesorado.
					</li>
				</ul>
			</dd>
		<dt>Desarrollo del proyecto:</dt>
			<dd>
				<ul>
					<li>
					En una primera fase se analizar&aacute; c&oacute;mo aumentar la compatibilidad
					entre ambas plataformas investigando qu&eacute; datos, archivos, preguntas de test, etc.
					son susceptibles de exportar/importar entre ellas.
					</li>
					<li>
		        		Se implementar&aacute;n varios m&oacute;dulos,
					al menos para migrar documentos en formato SCORM
					y tests de autoevaluaci&oacute;n,
					as&iacute; como otros datos que se hayan considerado de inter&eacute;s
					en la primera fase de an&aacute;lisis.
					</li>
				</ul>
			</dd>
	</dl>

	<hr />

	<h3>Proyecto ofertado 5:
	Cliente web accesible para la plataforma SWAD basado en servicios web</h3>

	<dl>
		<dt>Posibles interesados en desarrollarlo:</dt>
			<dd>
				<ul>
					<li>
					Estudiantes con capacidades de dise&ntilde;o de interfaces de usuario
					basadas en tecnolog&iacute;as web modernas,
					con inter&eacute;s en la usabilidad y la accesibilidad.
					</li>
				</ul>
			</dd>
		<dt>Planteamiento:</dt>
			<dd>
				<ul>
					<li>
					Se pretende desarrollar un cliente web para acceder a algunas funcionalidades
					de la plataforma SWAD.
					Actualmente est&aacute; disponible la aplicaci&oacute;n SWADroid
					para m&oacute;viles basados en Android,
					desarrollada en un proyecto fin de carrera anterior.
					Se pretende desarrollar una aplicaci&oacute;n cliente similar para cualquier navegador web.
					La idea es que el servidor SWAD proporcione una serie de funciones
					a trav&eacute;s de un servicio web,
					y que la aplicaci&oacute;n cliente a desarrollar
					sea la interfaz de usuario para el servidor.
					</li>
				</ul>
			</dd>
		<dt>Objetivos:</dt>
			<dd>
				<ul>
					<li>
					Desarrollar un cliente web b&aacute;sico
					que se conecte con la plataforma SWAD
					a trav&eacute;s del servicio web
					descrito en la p&aacute;gina
					<a href="http://openswad.org/ws/">http://openswad.org/ws/</a>.
					</li>
					<li>
		       			Incluir en el proyecto al menos las funcionalidades con las que cuenta actualmente
					la aplicaci&oacute;n SWADroid.
					</li>
					<li>
					Se contempla la posibilidad de ampliar las funcionalidades actuales de SWADroid.
					</li>
					<li>
					La aplicaci&oacute;n desarrollada deber&aacute;
					contar con una licencia libre desde el principio,
					y tendr&aacute; una arquitectura que facilite su desarrollo futuro por otras personas.
					</li>
				</ul>
			</dd>
		<dt>Desarrollo del proyecto:</dt>
			<dd>
				<ul>
					<li>
					Aprendizaje del funcionamiento de los servicios web. 
					</li>
					<li>
		        		Creaci&oacute;n de la arquitectura b&aacute;sica de la aplicaci&oacute;n
					que permita la autenticaci&oacute;n y la conexi&oacute;n con el servicio web de SWAD.
					</li>
					<li>
		        		Implementaci&oacute;n de las funcionalidades con las que ya cuenta SWADroid.
					</li>
					<li>
		        		Pruebas con usuarios reales.
					</li>
					<li>
		        		Posible ampliaci&oacute;n de las funcionalidades.
					</li>
				</ul>
			</dd>
	</dl>

	<hr />

	<h3>Proyecto ofertado 6:
	Estudio y an&aacute;lisis estad&iacute;stico de la utilizaci&oacute;n de plataformas docentes en la UGR</h3>

	<dl>
		<dt>Posibles interesados en desarrollarlo:</dt>
			<dd>
				<ul>
					<li>
					Estudiantes que no quieran programar,
					a los que se les d&eacute; bien la estad&iacute;stica,
					y que les guste redactar y componer documentos.
					</li>
				</ul>
			</dd>
		<dt>Planteamiento:</dt>
			<dd>
				<ul>
					<li>
					El amplio grado de utilizaci&oacute;n de diversas plataformas docentes
					en la Universidad de Granada,
					especialmente las tres plataformas de PRADO (Tabl&oacute;n de Docencia, SWAD, Moodle),
					sugiere la realizaci&oacute;n de un exhaustivo estudio estad&iacute;stico
					cuantitativo y cualitativo de su implantaci&oacute;n entre los distintos centros y titulaciones,
					que ser&aacute; abordado en este proyecto.
					</li>
				</ul>
			</dd>
		<dt>Objetivos:</dt>
			<dd>
				<ul>
					<li>
					Realizar un estudio estad&iacute;stico cuantitativo del uso de plataformas docentes
					en las distintas titulaciones de la UGR.
					Se profundizar&aacute; en las plataformas del CEVUG SWAD y Moodle
					ya que el tutor del proyecto tiene acceso a millones de datos
					almacenados en su base de datos a lo largo de los &uacute;ltimos a&ntilde;os.
					</li>
					<li>
		       			Complementar dicho estudio mediante la realizaci&oacute;n de encuestas
					de uso y satisfacci&oacute;n a los usuarios de plataformas utilizadas en la UGR.
					Se propone realizar tanto encuestas a pie de calle a estudiantes y profesores,
					como encuestas online usando la herramienta Lime Survey del CSIRC
					y las herramientas de encuestas de SWAD y de Moodle.
					</li>
				</ul>
			</dd>
		<dt>Desarrollo del proyecto:</dt>
			<dd>
				<ul>
					<li>
					En una primera fase se dise&ntilde;ar&aacute;n las estrategias
					y se concretar&aacute; la metodolog&iacute;a a seguir.
					</li>
					<li>
		        		Se realizar&aacute;n los an&aacute;lisis de los datos almacenados en las plataformas a las que tengamos acceso.
					</li>
					<li>
		        		Se llevar&aacute;n a cabo encuestas online.
					</li>
					<li>
        				Se realizar&aacute;n encuestas en distintos centros de la UGR.
					</li>
					<li>
		        		Todos los resultados ser&aacute;n tabulados y representados mediante gr&aacute;ficas.
					</li>
					<li>
		        		Se interpretar&aacute;n los datos y se escribir&aacute;
					y publicar&aacute; en abierto un amplio informe o libro blanco.
					</li>
				</ul>
			</dd>
	</dl>

<!--
	<hr />

	<h3>Proyecto previamente asignado:
	Editor de texto con f&oacute;rmulas LaTeX
	para su utilizaci&oacute;n en una plataforma de teleformaci&oacute;n</h3>

	<dl>
		<dt>Planteamiento:</dt>
			<dd>
				<ul>
					<li>
					Este proyecto est&aacute; motivado principalmente por la necesidad de dar formato
					e insertar f&oacute;rmulas en textos de la plataforma SWAD.
					</li>
					<li>
		       			Se desarrollar&aacute; un editor de texto simple que permita
					la utilizaci&oacute;n de negritas, cursivas, subrayado e
					inserci&oacute;n de enlaces, im&aacute;genes, y f&oacute;rmulas matem&aacute;ticas en formato LaTeX
					que se mostrar&aacute;n como una imagen.
					</li>
				</ul>
			</dd>
		<dt>Objetivos:</dt>
			<dd>
				<ul>
					<li>
					Analizar y comparar las distintas alternativas de c&oacute;digo abierto
					para edici&oacute;n de texto en &aacute;reas de texto en la web como de inserci&oacute;n de formulas LaTeX.
					</li>
					<li>
		       			Desarrollar un editor a medida de las necesidades espec&iacute;ficas de los profesores y los estudiantes en la plataforma SWAD.
					</li>
					<li>
		       			Integrar las distintas herramientas y probarlas exhaustivamente en la plataforma SWAD.
					</li>
				</ul>
			</dd>
		<dt>Desarrollo del proyecto:</dt>
			<dd>
				<ul>
					<li>
					Aprendizaje de Javascript.
					</li>
					<li>
		        		B&uacute;squeda de herramientas de edici&oacute;n de texto en &aacute;reas de texto e inserci&oacute;n de f&oacute;rmulas LaTeX.
					</li>
					<li>
		        		Comparaci&oacute;n de las distintas herramientas
					y selecci&oacute;n de aquella o aquellas que se acerquen m&aacute;s a nuestro objetivo.
					</li>
					<li>
        				Integrar las distintas herramientas para conseguir el editor de texto optimizado para las necesidades de SWAD.
					</li>
					<li>
		        		Pruebas con usuarios reales.
					</li>
					<li>
		        		Posible ampliaci&oacute;n a Wiki (editor colaborativo).
					</li>
				</ul>
			</dd>
		<dt>Estudiante:</dt>
			<dd>
				<ul>
					<li>
					David Medina Godoy
					</li>
				</ul>
			</dd>
	</dl>
-->
	</td>
	</tr>

     </table>
    </td>
   </tr>
  </table>
 </body>

</html>
